Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: > > You want to select a random character from a string: > > ~~~ > bases = 'ACTTGCTTGAC' > ~~~ > {: .language-python} > > 1. Which [standard library][stdlib] module could help you? > 2. Which function would you select from that module? Are there alternatives? > 3. Try to write a program that uses the function. > > > ## Solution > > > > The [random module][randommod] seems like it could help you. > > > > The string has 11 characters, each having a positional index from 0 to 10. > > You could use `random.randrange` function (or the alias `random.randint` > > if you find that easier to remember) to get a random integer between 0 and > > 10, and then pick out the character at that position: > > > > ~~~ > > from random import randrange > > > > random_index = randrange(len(bases)) > > print(bases[random_index]) > > ~~~ > > {: .language-python} > > > > or more compactly: > > > > ~~~ > > from random import randrange > > > > print(bases[randrange(len(bases))]) > > ~~~ > > {: .language-python} > > > > Perhaps you found the `random.sample` function? It allows for slightly > > less typing: > > > > ~~~ > > from random import sample > > > > print(sample(bases, 1)[0]) > > ~~~ > > {: .language-python} > > > > Note that this function returns a list of values. We will learn about > > lists in [episode 11]({% link _episodes/11-lists.md %}). > > > > There's also other functions you could use, but with more convoluted > > code as a result.
it: > > Immagina di voler scegliere un carattere a caso all'interno di una stringa: > > ~~~ > basi = 'ACTTGCTTGAC' > ~~~ > {: .language-python} > > 1. Quale modulo della [libreria standard][stdlib] può aiutarti? > 2. Che funzione sceglieresti all'interno di questo modulo? Ci sono diverse alternative? > 3. Prova a scrivere un programma usando quella funzione. > > > ## Soluzione > > > > Il [modulo random][randommod] (funzioni casuali) sembra essere d'aiuto. > > > > La stringa ha 11 caratteri, ognuno dei quali ha un indice posizionale tra 0 e 10. > > Puoi usare la funzione `random.randrange` (o il suo sinonimo `random.randint` > > se lo trovi più facile da ricordare) per ottenere un intero casuale tra 0 e > > 10, e poi scegliere il carattere corrispondente a quella posizione: > > > > ~~~ > > from random import randrange > > > > indice_casuale = randrange(len(basi)) > > print(basi[indice_casuale]) > > ~~~ > > {: .language-python} > > > > o anche, in maniera più compatta: > > > > ~~~ > > from random import randrange > > > > print(basi[randrange(len(basi))]) > > ~~~ > > {: .language-python} > > > > Forse avrai notato anche la funzione `random.sample`. Ci permette di essere > > più sintetici: > > > > ~~~ > > from random import sample > > > > print(sample(basi, 1)[0]) > > ~~~ > > {: .language-python} > > > > Nota che questa funzione restituisce una lista di valori. Impareremo a usare le liste > > nell'[episodio 11]({% link _episodes/11-lists.md %}). > > > > Ci sono anche altre funzioni che si potrebbero usare, ma ci costringerebbero a scrivere > > codice più contorto.

source: > ## Jigsaw Puzzle (Parson's Problem) Programming Example
it: > ## Esempio di programmazione: un puzzle (problema di Parson)

source: > > Rearrange the following statements so that a random > DNA base is printed and its index in the string. Not all statements may be needed. Feel free to use/add > intermediate variables. > > ~~~ > bases="ACTTGCTTGAC" > import math > import random > ___ = random.randrange(n_bases) > ___ = len(bases) > print("random base ", bases[___], "base index", ___) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > import math > > import random > > bases = "ACTTGCTTGAC" > > n_bases = len(bases) > > idx = random.randrange(n_bases) > > print("random base", bases[idx], "base index", idx) > > ~~~ > > {: .language-python}
it: > > Riordina le istruzioni seguenti in modo che una base di DNA casuale sia stampata > insieme al valore del suo indice all'interno della stringa. Non tutte le istruzioni sono > necessariamente da usare. Aggiungi liberamente variabili intermedie se vuoi. > > ~~~ > basi = "ACTTGCTTGAC" > import math > import random > ___ = random.randrange(n_basi) > ___ = len(basi) > print("base casuale ", basi[___], "indice della base", ___) > ~~~ > {: .language-python} > > > ## Soluzione > > > > ~~~ > > import math > > import random > > basi = "ACTTGCTTGAC" > > n_basi = len(basi) > > idx = random.randrange(n_basi) > > print("base casuale", bases[idx], "indice della base", idx) > > ~~~ > > {: .language-python}

source: > ## When Is Help Available?
it: > ## Quando è disponibile aiuto?

source: > > When a colleague of yours types `help(math)`, > Python reports an error: > > ~~~ > NameError: name 'math' is not defined > ~~~
it: > > Quando un tuo collega scrive `help(math)`, > Python dà un errore: > > ~~~ > NameError: name 'math' is not defined > ~~~

source: > > What has your colleague forgotten to do? > > > ## Solution > > > > Importing the math module (`import math`)
it: > > Che cosa ha dimenticato di fare il tuo collega? > > > ## Soluzione > > > > Ha dimenticato di importare il modulo math (`import math`)

source: > ## Importing With Aliases
it: > ## Importare con gli alias

source: > > 1. Fill in the blanks so that the program below prints `90.0`. > 2. Rewrite the program so that it uses `import` *without* `as`. > 3. Which form do you find easier to read? > > ~~~ > import math as m > angle = ____.degrees(____.pi / 2) > print(____) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > import math as m > > angle = m.degrees(m.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > can be written as > > > > ~~~ > > import math > > angle = math.degrees(math.pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Since you just wrote the code and are familiar with it, you might actually > > find the first version easier to read. But when trying to read a huge piece > > of code written by someone else, or when getting back to your own huge piece > > of code after several months, non-abbreviated names are often easier, except > > where there are clear abbreviation conventions.
it: > > 1. Riempi gli spazi vuoti in modo che il programma seguente stampi `90.0`. > 2. Riscrivi il programma in modo che usi `import` *senza* `as`. > 3. Quale delle due formi trovi sia più facile da leggere? > > ~~~ > import math as m > angolo = ____.degrees(____.pi / 2) > print(____) > ~~~ > {: .language-python} > > > ## Soluzione > > > > ~~~ > > import math as m > > angolo = m.degrees(m.pi / 2) > > print(angolo) > > ~~~ > > {: .language-python} > > > > può essere scritto anche > > > > ~~~ > > import math > > angolo = math.degrees(math.pi / 2) > > print(angolo) > > ~~~ > > {: .language-python} > > > > Poiché hai appena scritto questo codice e lo conosci bene, potresti > > trovare la prima versione più facile da leggere. Ma se leggessi un enorme programma > > scritto da qualcun altro, o tornassi a leggere un enorme programma scritto da te > > parecchi mesi più tardi, troveresti i nomi non abbreviati spesso più semplici, eccetto > > laddove ci sono chiare convenzioni su come abbreviare.

source: > ## There Are Many Ways To Import Libraries!
it: > ## Ci sono molti modi di importare le librerie!

source: > > Match the following print statements with the appropriate library calls. > > Print commands: > > 1. `print("sin(pi/2) =", sin(pi/2))` > 2. `print("sin(pi/2) =", m.sin(m.pi/2))` > 3. `print("sin(pi/2) =", math.sin(math.pi/2))` > > Library calls: > > 1. `from math import sin, pi` > 2. `import math` > 3. `import math as m` > 4. `from math import *` > > > ## Solution > > > > 1. Library calls 1 and 4. In order to directly refer to `sin` and `pi` without > > the library name as prefix, you need to use the `from ... import ...` > > statement. Whereas library call 1 specifically imports the two functions > > `sin` and `pi`, library call 4 imports all functions in the `math` module. > > 2. Library call 3. Here `sin` and `pi` are referred to with a shortened library > > name `m` instead of `math`. Library call 3 does exactly that using the > > `import ... as ...` syntax - it creates an alias for `math` in the form of > > the shortened name `m`. > > 3. Library call 2. Here `sin` and `pi` are referred to with the regular library > > name `math`, so the regular `import ...` call suffices.
it: > > Abbina le seguenti istruzioni `print` con il modo appropriato di importare la libreria. > > Istruzioni print: > > 1. `print("sin(pi/2) =", sin(pi/2))` > 2. `print("sin(pi/2) =", m.sin(m.pi/2))` > 3. `print("sin(pi/2) =", math.sin(math.pi/2))` > > Importazioni: > > 1. `from math import sin, pi` > 2. `import math` > 3. `import math as m` > 4. `from math import *` > > > ## Soluzione > > > > 1. La libreria può essere importata nei modi 1 e 4. Per poter chiamare `sin` e `pi` senza > > il nome della libreria come prefisso, bisogna usare l'istruzione `from ... import ...`. > > L'importazione 1 importa specificamente le due funzioni > > `sin` and `pi`, l'importazione 4 importa tutte le funzioni del modulo `math`. > > 2. L'importazione 3. Qui `sin` e `pi` sono chiamati con il nome abbreviato > > `m` anziché `math`. L'importazione 3 permette esattamente questo con la sintassi > > `import ... as ...`: crea l'alias `m` come forma abbreviata di `math`. > > 3. L'importazione 2. Qui `sin` e `pi` sono chiamati attraverso il normale nome > > della libreria `math`, quindi basta la semplice chiamata `import ...`.

source: > ## Importing Specific Items
it: > ## Importare elementi specifici

source: > > 1. Fill in the blanks so that the program below prints `90.0`. > 2. Do you find this version easier to read than preceding ones? > 3. Why *wouldn't* programmers always use this form of `import`? > > ~~~ > ____ math import ____, ____ > angle = degrees(pi / 2) > print(angle) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > from math import degrees, pi > > angle = degrees(pi / 2) > > print(angle) > > ~~~ > > {: .language-python} > > > > Most likely you find this version easier to read since it's less dense. > > The main reason not to use this form of import is to avoid name clashes. > > For instance, you wouldn't import `degrees` this way if you also wanted to > > use the name `degrees` for a variable or function of your own. Or if you > > were to also import a function named `degrees` from another library.
it: > > 1. Riempi gli spazi vuoti in modo che il programma seguente stampi `90.0`. > 2. Trovi che questa versione sia più facile da leggere rispetto alle precedenti? > 3. Qual è una possibile ragione per *non* usare sempre questa forma di `import`? > > ~~~ > ____ math import ____, ____ > angolo = degrees(pi / 2) > print(angolo) > ~~~ > {: .language-python} > > > ## Soluzione > > > > ~~~ > > from math import degrees, pi > > angolo = degrees(pi / 2) > > print(angolo) > > ~~~ > > {: .language-python} > > > > Probabilmente troverai questa versione più facile da leggere, visto che è meno disordinata. > > La ragione principale per non usare questo modo di importare è quando si vogliono evitare conflitti di nomi. > > Per esempio, non puoi importare `degrees` in questo modo quando vuoi anche > > usare il nome `degrees` per una variabile o una funzione scritta da te, o se > > ti serve anche importare una funzione chiamata `degrees` da un'altra libreria.

source: > ## Reading Error Messages
it: > ## Leggere i messaggi di errore

source: > > 1. Read the code below and try to identify what the errors are without running it. > 2. Run the code, and read the error message. What type of error is it? > > ~~~ > from math import log > log(0) > ~~~ > {: .language-python} > > > ## Solution > > > > 1. The logarithm of `x` is only defined for `x > 0`, so 0 is outside the > > domain of the function. > > 2. You get an error of type "ValueError", indicating that the function > > received an inappropriate argument value. The additional message > > "math domain error" makes it clearer what the problem is.
it: > > 1. Leggi il codice seguente e cerca di identificare gli errori senza eseguirlo. > 2. Esegui il codice, e leggi il messaggio di errore. Che tipo di errore è? > > ~~~ > from math import log > log(0) > ~~~ > {: .language-python} > > > ## Soluzione > > > > 1. Il logaritmo di `x` è definito solo per `x > 0`, pertanto 0 è al di fuori del > > dominio della funzione. > > 2. Si ottiene un errore di tipo "ValueError", che indica che la funzione > > ha ricevuto un valore inadatto in uno dei suoi argomenti. Il messaggio aggiuntivo > > "math domain error" chiarifica qual è il problema.

source: --- title: "Reading Tabular Data into DataFrames" teaching: 10 exercises: 10 questions: - "How can I read tabular data?" objectives: - "Import the Pandas library." - "Use Pandas to load a simple CSV data set." - "Get some basic information about a Pandas DataFrame." keypoints: - "Use the Pandas library to get basic statistics out of tabular data." - "Use `index_col` to specify that a column's values should be used as row headings." - "Use `DataFrame.info` to find out more about a dataframe." - "The `DataFrame.columns` variable stores information about the dataframe's columns." - "Use `DataFrame.T` to transpose a dataframe." - "Use `DataFrame.describe` to get summary statistics about data." ---
it: --- title: "Leggere tabelle sottoforma di DataFrame" teaching: 10 exercises: 10 questions: - "Come si possono leggere i dati di una tabella?" objectives: - "Importare la libreria Pandas." - "Usare Pandas per caricare un semplice dataset in formato CSV." - "Leggere le informazioni di base relative a un DataFrame di Pandas." keypoints: - "Usare la libreria Pandas per studiare le statistiche di base di una tabella di dati." - "Usre `index_col` per specificare che i valori di una colonna devono essere usati come titoli delle righe." - "Usare `DataFrame.info` per saperne di più su un dataframe." - "La variabile `DataFrame.columns` contiene le informazioni relative alle colonne del dataframe." - "Usare `DataFrame.T` per trasporre un dataframe." - "Usare `DataFrame.describe` per calcolare le statistiche riassuntive di un insieme di dati." ---

source: ## Use the Pandas library to do statistics on tabular data.
it: ## Usare la libreria Pandas per studiare le statistiche di base di una tabella di dati.

source: * Pandas is a widely-used Python library for statistics, particularly on tabular data.
it: * Pandas è una libreria di Python, diffusamente usata per la statistica, in particolare su dati tabulari.

source: * Borrows many features from R's dataframes.
it: * Prende in prestito molte caratteristiche dei dataframe del linguaggio di programmazione R.

source: * A 2-dimensional table whose columns have names
it: * Una tabella bidimensionale le cui colonne hanno nomi assegnati

source: and potentially have different data types. * Load it with `import pandas as pd`. The alias pd is commonly used for Pandas. * Read a Comma Separate Values (CSV) data file with `pd.read_csv`. * Argument is the name of the file to be read. * Assign result to a variable to store the data that was read.
it: e, potenzialmente, tipi di dati diversi. * La libreria si importa usando `import pandas as pd`. L'alias `pd` è quello usato più comunemente per Pandas. * Si può leggere un file di dati CSV (Comma-Separated Values, valori separati da virgole) usando `pd.read_csv`. * L'argomento della funzione è il nome del file da leggere. * Per tenere in memoria i dati letti dal file, si assegna il risultato a una variabile.

source: * The columns in a dataframe are the observed variables, and the rows are the observations.
it: * Le colonne di un dataframe sono le variabili misurate, mentre le righe sono le singole misurazioni.

source: * Pandas uses backslash `\` to show wrapped lines when output is too wide to fit the screen.
it: * Pandas usa la barra rovesciata `\` per indicare le linee di testo che sono state mandate a capo perché troppo larghe per lo schermo.

source: > ## File Not Found
it: > ## File non trovato

source: > > Our lessons store their data files in a `data` sub-directory, > which is why the path to the file is `data/gapminder_gdp_oceania.csv`. > If you forget to include `data/`, > or if you include it but your copy of the file is somewhere else, > you will get a [runtime error]({{ page.root }}/04-built-in/#runtime-error) > that ends with a line like this: > > ~~~ > OSError: File b'gapminder_gdp_oceania.csv' does not exist > ~~~
it: > > Le nostre lezioni hanno i file di dati salvati in una sottocartella `data`, > ragion per cui il percorso del file è `data/gapminder_gdp_oceania.csv`. > Se ti dimentichi di mettere `data/`, o se lo metti, ma la tua copia > del file è stata salvata altrove, otterrai un > [runtime error]({{ page.root }}/04-built-in/#runtime-error) > che finisce con una frase come questa: > > ~~~ > OSError: File b'gapminder_gdp_oceania.csv' does not exist > ~~~

source: ## Use `index_col` to specify that a column's values should be used as row headings.
it: ## Usare `index_col` per specificare che i valori di una colonna devono essere usati come titoli delle righe.

source: * Row headings are numbers (0 and 1 in this case).
it: * I titoli delle righe sono numeri (0 e 1, in questo caso).

source: * Really want to index by country.
it: * Vogliamo però indicizzare in base al paese.

source: * Pass the name of the column to `read_csv` as its `index_col` parameter to do this.
it: * Per fare ciò, passa il nome della colonna alla funzione `read_csv` attraverso il suo parametro `index_col`.

source: ## Use `DataFrame.info` to find out more about a dataframe.
it: ## Usare `DataFrame.info` per saperne di più su un dataframe.

source: * This is a `DataFrame`
it: * Questo è un `DataFrame`

source: * Two rows named `'Australia'` and `'New Zealand'`
it: * Due righe, chiamate `'Australia'` e `'New Zealand'`

source: * Twelve columns, each of which has two actual 64-bit floating point values.
it: * Dodici colonne, ognuna delle quali contiene due valori in virgola mobile a 64 bit.

source: * We will talk later about null values, which are used to represent missing observations.
it: * Più avanti parleremo anche dei valori "nulli", che sono usati per indicare misurazioni mancanti.

source: * Uses 208 bytes of memory.
it: * Usa 208 byte di memoria.

source: ## The `DataFrame.columns` variable stores information about the dataframe's columns.
it: ## La variabile `DataFrame.columns` contiene le informazioni relative alle colonne del dataframe.

source: * Note that this is data, *not* a method.
it: * Nota bene, questa è una variabile che contiene dati, *non* un metodo.

source: * Like `math.pi`.
it: * Allo stesso modo di `math.pi`.

source: * So do not use `()` to try to call it.
it: * Per cui, non si usa `()` per chiamarlo.

source: * Called a *member variable*, or just *member*.
it: * Queste variabili vengono chiamate *membri*.

source: ## Use `DataFrame.T` to transpose a dataframe.
it: ## Usare `DataFrame.T` per trasporre un dataframe.

source: * Sometimes want to treat columns as rows and vice versa.
it: * A volte, capita di voler trattare le righe come colonne, o viceversa.

source: * Transpose (written `.T`) doesn't copy the data, just changes the program's view of it.
it: * La trasposta (che si scrive `.T`) non copia i dati in un nuovo dataframe, ma cambia la 'vista' che il programma ha dei dati.

source: * Like `columns`, it is a member variable.
it: * Come `columns`, è una variabile membro.

source: ## Use `DataFrame.describe` to get summary statistics about data.
it: ## Usare `DataFrame.describe` per calcolare le statistiche riassuntive di un insieme di dati.

source: DataFrame.describe() gets the summary statistics of only the columns that have numerical data. All other columns are ignored, unless you use the argument `include='all'`. ~~~ print(data.describe()) ~~~ {: .language-python} ~~~ gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 gdpPercap_1967 \ count 2.000000 2.000000 2.000000 2.000000 mean 10298.085650 11598.522455 12696.452430 14495.021790 std 365.560078 917.644806 677.727301 43.986086 min 10039.595640 10949.649590 12217.226860 14463.918930 25% 10168.840645 11274.086022 12456.839645 14479.470360 50% 10298.085650 11598.522455 12696.452430 14495.021790 75% 10427.330655 11922.958888 12936.065215 14510.573220 max 10556.575660 12247.395320 13175.678000 14526.124650
it: DataFrame.describe() calcola le statistiche riassuntive delle sole colonne che contengono dati numerici. Tutte le altre colonne vengono ignorate, a meno di usare l'argomento `include='all'`. ~~~ print(data.describe()) ~~~ {: .language-python} ~~~ gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 gdpPercap_1967 \ count 2.000000 2.000000 2.000000 2.000000 mean 10298.085650 11598.522455 12696.452430 14495.021790 std 365.560078 917.644806 677.727301 43.986086 min 10039.595640 10949.649590 12217.226860 14463.918930 25% 10168.840645 11274.086022 12456.839645 14479.470360 50% 10298.085650 11598.522455 12696.452430 14495.021790 75% 10427.330655 11922.958888 12936.065215 14510.573220 max 10556.575660 12247.395320 13175.678000 14526.124650

source: * Not particularly useful with just two records,
it: * Non è un'operazione particolarmente utile quando abbiamo solo due righe,

source: but very helpful when there are thousands.
it: ma può essere molto utile quando ne abbiamo migliaia.

source: > ## Reading Other Data
it: > ## Leggere altri dati

source: > > Read the data in `gapminder_gdp_americas.csv` > (which should be in the same directory as `gapminder_gdp_oceania.csv`) > into a variable called `americas` > and display its summary statistics. > > > ## Solution > > To read in a CSV, we use `pd.read_csv` and pass the filename 'data/gapminder_gdp_americas.csv' to it. We also once again pass the > > column name 'country' to the parameter `index_col` in order to index by country: > > ~~~ > > americas = pd.read_csv('data/gapminder_gdp_americas.csv', index_col='country') > > ~~~ > >{: .language-python}
it: > > Carica i dati contenuti nel file `gapminder_gdp_americas.csv` > (che dovrebbe essere nella stessa cartella di `gapminder_gdp_oceania.csv`) > in una variabile chiamata `americas` > e mostra le sue statistiche riassuntive. > > > ## Soluzione > > Per leggere da un CSV, usiamo `pd.read_csv` passando il nome del file 'data/gapminder_gdp_americas.csv' alla funzione. Inoltre, passiamo > > ancora una volta il nome della colonna 'country' al parametro > > `index_col` in modo da indicizzare per paese: > > ~~~ > > americas = pd.read_csv('data/gapminder_gdp_americas.csv', index_col='country') > > ~~~ > >{: .language-python}

source: > ## Inspecting Data.
it: > ## Esaminare i dati.
