Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: * The quote marks aren't printed when the string is displayed.
it: * Le virgolette non vengono stampate quando la stringa viene visualizzata.

source: ## Use the built-in function `type` to find the type of a value.
it: ## Per scoprire il tipo di una variabile, si usa la funzione predefinita `type`.

source: * Use the built-in function `type` to find out what type a value has.
it: * Per scoprire qual è il tipo corrispondente a un valore, usa la funzione predefinita `type`.

source: * Works on variables as well.
it: * Funziona anche sulle variabili.

source: * But remember: the *value* has the type --- the *variable* is just a label.
it: * Ma non dimenticare che è il *valore* ad avere quel tipo; la *variabile* è solo un'etichetta.

source: ## Types control what operations (or methods) can be performed on a given value.
it: ## In base al tipo, le operazioni che si possono fare su un valore sono diverse.

source: * A value's type determines what the program can do to it.
it: * È il tipo di un valore a determinare che cosa il programma può fare con quel valore.

source: ~~~ print('hello' - 'h') ~~~
it: ~~~ print('ciao' - 'c') ~~~

source: {: .language-python} ~~~ --------------------------------------------------------------------------- TypeError Traceback (most recent call last) <ipython-input-2-67f5626a1e07> in <module>() ----> 1 print('hello' - 'h')
it: {: .language-python} ~~~ --------------------------------------------------------------------------- TypeError Traceback (most recent call last) <ipython-input-2-67f5626a1e07> in <module>() ----> 1 print('ciao' - 'c')

source: ## You can use the "+" and "*" operators on strings.
it: ## Si possono usare gli operatori "+" e "*" anche sulle stringhe.

source: * "Adding" character strings concatenates them.
it: * Il simbolo di addizione concatena le stringhe l'una all'altra.

source: ~~~ full_name = 'Ahmed' + ' ' + 'Walsh' print(full_name) ~~~
it: ~~~ nome = 'Ahmed' + ' ' + 'Walsh' print(nome) ~~~

source: * Multiplying a character string by an integer _N_ creates a new string that consists of that character string repeated _N_ times.
it: * Moltiplicare una stringa di caratteri per un numero intero _N_ crea una nuova stringa che consiste di quella stringa di caratteri ripetuta _N_ volte.

source: * Since multiplication is repeated addition.
it: * Poiché la moltiplicazione è un'addizione ripetuta.

source: ~~~ separator = '=' * 10 print(separator) ~~~
it: ~~~ separatore = '=' * 10 print(separatore) ~~~

source: ## Strings have a length (but numbers don't).
it: ## Le stringhe hanno una lunghezza, i numeri no.

source: * The built-in function `len` counts the number of characters in a string.
it: * La funzione predefinita `len` conta il numero di caratteri in una stringa

source: ~~~ print(len(full_name)) ~~~
it: ~~~ print(len(nome)) ~~~

source: * But numbers don't have a length (not even zero).
it: * Ma i numeri non hanno una lunghezza (nemmeno zero).

source: ## <a name='convert-numbers-and-strings'></a> Must convert numbers to strings or vice versa when operating on them.
it: ## <a name='convert-numbers-and-strings'></a> Lavorando su stringhe e numeri, è necessario convertire stringhe in numeri o viceversa.

source: * Cannot add numbers and strings.
it: * Non è possibile sommare numeri e stringhe insieme.

source: * Not allowed because it's ambiguous: should `1 + '2'` be `3` or `'12'`?
it: * Non è permesso in quanto ambiguo: `1 + '2'` dovrebbe risultare in `3` o in `'12'`?

source: * Some types can be converted to other types by using the type name as a function.
it: * Alcuni tipi possono essere convertiti in altri usando il nome del tipo come una funzione.

source: ## Can mix integers and floats freely in operations.
it: ## Gli interi e i numeri a virgola mobile possono essere usati insieme liberamente in operazioni matematiche.

source: * Integers and floating-point numbers can be mixed in arithmetic.
it: * Gli interi e i float (numeri a virgola mobile) possono essere mescolati nelle operazioni aritmetiche.

source: * Python 3 automatically converts integers to floats as needed. (Integer division in Python 2 will return an integer, the *floor* of the division.)
it: * Python 3 converte automaticamente gli interi in float quando è necessario. (La divisione tra interi in Python 2 ritornava un intero, il quoziente intero approssimato per difetto.)

source: ~~~ print('half is', 1 / 2.0) print('three squared is', 3.0 ** 2) ~~~
it: ~~~ print('un mezzo è', 1 / 2.0) print('tre al quadrato è', 3.0 ** 2) ~~~

source: {: .language-python} ~~~ half is 0.5 three squared is 9.0 ~~~
it: {: .language-python} ~~~ un mezzo è 0.5 tre al quadrato è 9.0 ~~~

source: ## Variables only change value when something is assigned to them.
it: ## Le variabili possono cambiare valore solo quando un nuovo valore viene loro assegnato

source: * If we make one cell in a spreadsheet depend on another,
it: * In un foglio di calcolo, se facciamo dipendere una cella da un'altra,

source: and update the latter, the former updates automatically. * This does **not** happen in programming languages.
it: e modifichiamo il contenuto di quest'ultima, la prima si aggiorna automaticamente. * Questo **non** succede nei linguaggi di programmazione.

source: ~~~ first = 1 second = 5 * first first = 2 print('first is', first, 'and second is', second) ~~~
it: ~~~ prima = 1 seconda = 5 * prima prima = 2 print('la prima è', prima, 'e la seconda è', seconda) ~~~

source: {: .language-python} ~~~ first is 2 and second is 5 ~~~
it: {: .language-python} ~~~ la prima è 2 e la seconda è 5 ~~~

source: * The computer reads the value of `first` when doing the multiplication,
it: * Nel fare la moltiplicazione, il computer legge il valore di `prima`,

source: creates a new value, and assigns it to `second`. * After that, `second` does not remember where it came from.
it: crea un nuovo valore, e lo assegna a `seconda`. * Dopodiché, `seconda` non si ricorda la propria origine.

source: > ## Fractions
it: > ## Frazioni

source: > > What type of value is 3.4? > How can you find out? > > > ## Solution > > > > It is a floating-point number (often abbreviated "float"). > > > > ~~~ > > print(type(3.4)) > > ~~~ > > {: .language-python} > > ~~~ > > <class 'float'> > > ~~~ > > {: .output}
it: > > Di che tipo è il valore 3.4? > Come si può scoprire? > > > ## Soluzione > > > > È un numero a virgola mobile (floating point number, spesso abbreviato "float"). > > > > ~~~ > > print(type(3.4)) > > ~~~ > > {: .language-python} > > ~~~ > > <class 'float'> > > ~~~ > > {: .output}

source: > ## Automatic Type Conversion
it: > ## Conversione di tipo automatica

source: > > What type of value is 3.25 + 4? > > > ## Solution > > > > It is a float: > > integers are automatically converted to floats as necessary. > > > > ~~~ > > result = 3.25 + 4 > > print(result, 'is', type(result)) > > ~~~ > > {: .language-python} > > ~~~ > > 7.25 is <class 'float'> > > ~~~ > > {: .output}
it: > > Di che tipo è il valore 3.25 + 4? > > > ## Soluzione > > > > È un float: > > gli interi sono automaticamente convertiti in float quando necessario. > > > > ~~~ > > risultato = 3.25 + 4 > > print(risultato, 'è un', type(risultato)) > > ~~~ > > {: .language-python} > > ~~~ > > 7.25 è un <class 'float'> > > ~~~ > > {: .output}

source: > ## Choose a Type
it: > ## Scegliere un tipo

source: > > What type of value (integer, floating point number, or character string) > would you use to represent each of the following? Try to come up with more than one good answer for each problem. For example, in # 1, when would counting days with a floating point variable make more sense than using an integer? > > 1. Number of days since the start of the year. > 2. Time elapsed from the start of the year until now in days. > 3. Serial number of a piece of lab equipment. > 4. A lab specimen's age > 5. Current population of a city. > 6. Average population of a city over time. > > > ## Solution > > > > The answers to the questions are: > > 1. Integer, since the number of days would lie between 1 and 365. > > 2. Floating point, since fractional days are required > > 3. Character string if serial number contains letters and numbers, otherwise integer if the serial number consists only of numerals > > 4. This will vary! How do you define a specimen's age? whole days since collection (integer)? date and time (string)? > > 5. Choose floating point to represent population as large aggregates (eg millions), or integer to represent population in units of individuals. > > 6. Floating point number, since an average is likely to have a fractional part. > > {: .output}
it: > > Che tipo di valore (intero, numero a virgola mobile, o stringa di caratteri) > useresti per rappresentare gli esempi che seguono? Prova a cercare più di una risposta valida > per ogni problema. Per esempio, nel n. 1, in quali casi avrebbe più senso contare i giorni con una > variabile a virgola mobile rispetto a un intero? > > 1. Il numero dei giorni passati dall'inizio dell'anno. > 2. Il tempo passato dall'inizio dell'anno ad oggi, espresso in giorni. > 3. Il numero di serie di uno strumento di laboratorio. > 4. L'età di un campione da laboratorio. > 5. L'attuale popolazione di una città. > 6. La popolazione media di una città nel tempo. > > > ## Soluzione > > > > Le risposte sono: > > 1. Intero, dal momento che il numero di giorni sarà compreso tra 1 e 365. > > 2. A virgola mobile, dal momento che serviranno frazioni di giorni. > > 3. Una stringa di caratteri se il numero di serie contiene numeri e lettere, altrimenti un intero se il numero di serie consiste di sole cifre. > > 4. Dipende! Come è definita l'età del campione? in giorni completi a partire dalla raccolta (intero)? una data e un'ora (stringa)? > > 5. Scegli un numero a virgola mobile per rappresentare la popolazione in grandi quantità (p. es. milioni), o un intero per rappresentare la popolazione in unità di individui. > > 6. Un float, dal momento che una media probabilmente avrà valori frazionari. > > {: .output}

source: > ## Division Types
it: > ## Tipi di divisioni

source: > > In Python 3, the `//` operator performs integer (whole-number) floor division, the `/` operator performs floating-point > division, and the '%' (or *modulo*) operator calculates and returns the remainder from integer division: > > ~~~ > print('5 // 3:', 5//3) > print('5 / 3:', 5/3) > print('5 % 3:', 5%3) > ~~~ > {: .language-python} > > ~~~ > 5 // 3: 1 > 5 / 3: 1.6666666666666667 > 5 % 3: 2 > ~~~
it: > > In Python 3, l'operatore `//` esegue la divisione intera (con quoziente intero senza resto, > approssimando per difetto), l'operatore `/` effettua la divisione con la virgola, > e l'operatore '%' (detto *modulo*) calcola e restituisce il resto della divisione intera: > > ~~~ > print('5 // 3:', 5//3) > print('5 / 3:', 5/3) > print('5 % 3:', 5%3) > ~~~ > {: .language-python} > > ~~~ > 5 // 3: 1 > 5 / 3: 1.6666666666666667 > 5 % 3: 2 > ~~~

source: > > However in Python2 (and other languages), the `/` operator between two integer types perform a floor (`//`) division. To perform a float division, we have to convert one of the integers to float. > > ~~~ > print('5 // 3:', 1) > print('5 / 3:', 1 ) > print('5 / float(3):', 1.6666667 ) > print('float(5) / 3:', 1.6666667 ) > print('float(5 / 3):', 1.0 ) > print('5 % 3:', 2) > ~~~ > > If `num_subjects` is the number of subjects taking part in a study, > and `num_per_survey` is the number that can take part in a single survey, > write an expression that calculates the number of surveys needed > to reach everyone once. > > > ## Solution > > We want the minimum number of surveys that reaches everyone once, which is > > the rounded up value of `num_subjects / num_per_survey`. This is > > equivalent to performing an integer division with `//` and adding 1. > > ~~~ > > num_subjects = 600 > > num_per_survey = 42 > > num_surveys = num_subjects // num_per_survey + 1 > > > > print(num_subjects, 'subjects,', num_per_survey, 'per survey:', num_surveys) > > ~~~ > > {: .language-python} > > ~~~ > > 600 subjects, 42 per survey: 15 > > ~~~ > > {: .output}
it: > > Tuttavia, in Python2 (e altri linguaggi), l'operatore `/` tra due tipi interi esegue la divisione intera (`//`) division. Per fare una divisione con la virgola, siamo costretti a convertire uno degli interi in float. > > ~~~ > print('5 // 3:', 1) > print('5 / 3:', 1 ) > print('5 / float(3):', 1.6666667 ) > print('float(5) / 3:', 1.6666667 ) > print('float(5 / 3):', 1.0 ) > print('5 % 3:', 2) > ~~~ > > Se `n_soggetti` è il numero di soggetti che partecipano a uno studio, > e `n_per_sondaggio` è il numero che partecipa a un singolo sondaggio, > scrivi un'espressione che calcola il numero di sondaggi necessari > a raggiungere tutti i partecipanti una volta. > > > ## Soluzione > > Vogliamo sapere il numero di sondaggi che raggiungono tutti una volta, che è > > il valore approssimato per eccesso di `n_soggetti / n_per_sondaggio`. Ciò è lo stesso che > > eseguire una divisione intera con `//` e aggiungere 1. > > ~~~ > > n_soggetti = 600 > > n_per_sondaggio = 42 > > n_sondaggi = n_soggetti // n_per_sondaggio + 1 > > > > print(n_soggetti, 'soggetti,', n_per_sondaggio, 'per sondaggio:', n_sondaggi) > > ~~~ > > {: .language-python} > > ~~~ > > 600 soggetti, 42 per sondaggio: 15 > > ~~~ > > {: .output}

source: > ## Strings to Numbers
it: > ## Da stringhe a numer

source: > > Where reasonable, `float()` will convert a string to a floating point number, > and `int()` will convert a floating point number to an integer: > > ~~~ > print("string to float:", float("3.4")) > print("float to int:", int(3.4)) > ~~~ > {: .language-python} > > ~~~ > string to float: 3.4 > float to int: 3 > ~~~
it: > > Ogniqualvolta sia ragionevolmente possibile, `float()` è in grado di convertire una stringa in un float, > e `int()` converte un float in un intero: > > ~~~ > print("da stringa a float:", float("3.4")) > print("da float a int:", int(3.4)) > ~~~ > {: .language-python} > > ~~~ > da stringa a float: 3.4 > da float a int: 3 > ~~~

source: > > If the conversion doesn't make sense, however, an error message will occur > > ~~~ > print("string to float:", float("Hello world!")) > ~~~ > {: .language-python} > > ~~~ > --------------------------------------------------------------------------- > ValueError Traceback (most recent call last) > <ipython-input-5-df3b790bf0a2> in <module>() > ----> 1 print("string to float:", float("Hello world!")) > > ValueError: could not convert string to float: 'Hello world!' > ~~~
it: > > Se la conversione non ha senso, però, appare un messaggio di errore> > ~~~ > print("da stringa a float:", float("Hello world!")) > ~~~ > {: .language-python} > > ~~~ > --------------------------------------------------------------------------- > ValueError Traceback (most recent call last) > <ipython-input-5-df3b790bf0a2> in <module>() > ----> 1 print("da string a float:", float("Hello world!")) > > ValueError: could not convert string to float: 'Hello world!' > ~~~

source: > > Given this information, what do you expect the following program to do? > > What does it actually do? > > Why do you think it does that? > > ~~~ > print("fractional string to int:", int("3.4")) > ~~~ > {: .language-python} > > > ## Solution > > What do you expect this program to do? It would not be so unreasonable to expect the Python 3 `int` command to > > convert the string "3.4" to 3.4 and an additional type conversion to 3. After all, Python 3 performs a lot of other > > magic - isn't that part of its charm? > > > > However, Python 3 throws an error. Why? To be consistent, possibly. If you ask Python to perform two consecutive > > typecasts, you must convert it explicitly in code. > > > > ~~~ > > int("3.4") > > int(float("3.4")) > > ~~~ > > {: .language-python} > > ~~~ > > In [2]: int("3.4") > > --------------------------------------------------------------------------- > > ValueError Traceback (most recent call last) > > <ipython-input-2-ec6729dfccdc> in <module>() > > ----> 1 int("3.4") > > ValueError: invalid literal for int() with base 10: '3.4' > > 3 > > ~~~ > > {: .output}
it: > > Date queste informazioni, cosa ti aspetti che faccia questo programma? > > Che cosa fa in realtà? > > Perche, secondo te, fa così? > > ~~~ > print("stringa frazionaria a intero:", int("3.4")) > ~~~ > {: .language-python} > > > ## Solution > > Non sarebbe irragionevole aspettarsi che il comando `int` in Python 3 converta la stringa > > "3.4" in 3.4 e poi faccia un'ulteriore conversione di tipo arrivando a 3. Dopo tutto Python 3 > > fa un sacco di altre magie: il bello è quello. > > > > Eppure, Python 3 ci dà un errore. Perché? Forse, per essere coerente. Se si chiede a Python di fare > > due "typecasts" (conversioni di tipo), bisogna farle esplicitamente nel codice. > > > > ~~~ > > int("3.4") > > int(float("3.4")) > > ~~~ > > {: .language-python} > > ~~~ > > In [2]: int("3.4") > > --------------------------------------------------------------------------- > > ValueError Traceback (most recent call last) > > <ipython-input-2-ec6729dfccdc> in <module>() > > ----> 1 int("3.4") > > ValueError: invalid literal for int() with base 10: '3.4' > > 3 > > ~~~ > > {: .output}

source: > ## Arithmetic with Different Types
it: > ## Aritmetica con tipi diversi

source: > > Which of the following will return the floating point number `2.0`? > Note: there may be more than one right answer. > > ~~~ > first = 1.0 > second = "1" > third = "1.1" > ~~~ > {: .language-python} > > 1. `first + float(second)` > 2. `float(second) + float(third)` > 3. `first + int(third)` > 4. `first + int(float(third))` > 5. `int(first) + int(float(third))` > 6. `2.0 * second` > > > ## Solution > > > > Answer: 1 and 4
it: > > Quali delle opzioni seguenti ci restituiranno il numero `2.0` in virgola mobile? > Nota: può esserci più di una risposta esatta. > > ~~~ > prima = 1.0 > seconda = "1" > terza = "1.1" > ~~~ > {: .language-python} > > 1. `prima + float(seconda)` > 2. `float(seconda) + float(terza)` > 3. `first + int(terza)` > 4. `first + int(float(terza))` > 5. `int(prima) + int(float(terza))` > 6. `2.0 * seconda` > > > ## Soluzione > > > > Risposta: 1 e 4

source: > ## Complex Numbers
it: > ## Numeri complessi

source: > > Python provides complex numbers, > which are written as `1.0+2.0j`. > If `val` is an imaginary number, > its real and imaginary parts can be accessed using *dot notation* > as `val.real` and `val.imag`. > > ~~~ > complex = 6 + 2j > print(complex.real) > print(complex.imag) > ~~~ > {: .language-python} > > ~~~ > 6.0 > 2.0 > ~~~
it: > > Python offre l'uso dei numeri complessi, > che si scrivono `1.0+2.0j`. > Se `val` è un numero immaginario, > si può accedere alle sua parti reale e immaginaria usando la *notazione punto* > cioè `val.real` e `val.imag`. > > ~~~ > complesso = 6 + 2j > print(complesso.real) > print(complesso.imag) > ~~~ > {: .language-python} > > ~~~ > 6.0 > 2.0 > ~~~

source: > > > 1. Why do you think Python uses `j` instead of `i` for the imaginary part? > 2. What do you expect `1+2j + 3` to produce? > 3. What do you expect `4j` to be? What about `4 j` or `4 + j`? > > > ## Solution > > > > 1. Standard mathematics treatments typically use `i` to denote an imaginary number. However, from media reports it > > was an early convention established from electrical engineering that now presents a technically expensive area to > > change. [Stack Overflow provides additional explanation and > > discussion.](http://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i) > > 2. `(4+2j)` > > 3. `4j`, `Syntax Error: invalid syntax`, in this case _j_ is considered a variable and this depends on if _j_ is defined and if so, its assigned value
it: > > > 1. Perché, secondo te, Python usa `j` instead of `i` per la parte immaginaria? > 2. Cosa ti aspetti che sia il risultato di `1+2j + 3`? > 3. Cosa ti aspetti che sia `4j`? E invece `4 j` oppure `4 + j`? > > > ## Soluzione > > > > 1. L'uso matematico standard è tipicamente quello di indicare un numero immaginario con `i`. Tuttavia, da quanto dicono i media, > > l'uso di `j` è una vecchia convenzione usata in ingegneria elettrica che sarebbe ora difficile cambiare. [Stack Overflow contiene spiegazioni e discussioni > > ulteriori.](http://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i) > > 2. `(4+2j)` > > 3. `4j`, `Syntax Error: invalid syntax`, in questo caso _j_ è considerata una variabile, e il risultato dipende da se _j_ è definita e, se lo è, dal suo valore assegnato.

source: --- title: "Built-in Functions and Help" teaching: 15 exercises: 10 questions: - "How can I use built-in functions?" - "How can I find out what they do?" - "What kind of errors can occur in programs?" objectives: - "Explain the purpose of functions." - "Correctly call built-in Python functions." - "Correctly nest calls to built-in functions." - "Use help to display documentation for built-in functions." - "Correctly describe situations in which SyntaxError and NameError occur." keypoints: - "Use comments to add documentation to programs." - "A function may take zero or more arguments." - "Commonly-used built-in functions include `max`, `min`, and `round`." - "Functions may only work for certain (combinations of) arguments." - "Functions may have default values for some arguments." - "Use the built-in function `help` to get help for a function." - "The Jupyter Notebook has two ways to get help." - "Every function returns something." - "Python reports a syntax error when it can't understand the source of a program." - "Python reports a runtime error when something goes wrong while a program is executing." - "Fix syntax errors by reading the source code, and runtime errors by tracing the program's execution." ---
it: --- title: "Funzioni predefinite e aiuto" teaching: 15 exercises: 10 questions: - "Come si usano le funzioni predefinite?" - "Come si fa a sapere cosa fanno?" - "Quali sono i tipi di errori che possono presentarsi in un programma?" objectives: - "Spiegare a cosa servono le funzioni." - "Chiamare correttamente le funzioni predefinite di Python." - "Usare correttamente funzioni predefinite nidificate una dentro l'altra." - "Usare l'aiuto per visualizzare la documentazione di funzioni predefinite." - "Descrivere correttamente i casi in cui possono presentarsi SyntaxError e NameError." keypoints: - "Usare i commenti per aggiungere documentazione ai programmi." - "Una funzione può ricevere zero o più argomenti." - "Tra le funzioni predefinite più comuni ci sono `max`, `min` e `round`." - "Le funzioni possono funzionare solo con certe combinazioni di argomenti." - "Le funzioni possono avere valori predefiniti per alcuni argomenti." - "Usare la funzione predefinita `help` per ottenere aiuto relativamente a una funzione." - "Il Jupyter Notebook ha due modi di mostrare l'aiuto." - "Tutte le funzioni restituiscono qualcosa." - "Python mostra un errore di sintassi quando non riesce a capire il codice sorgente di un programma." - "Python mostra un errore runtime quanto qualcosa non funziona mentre il programma viene eseguito." - "Gli errori di sintassi si risolvono rileggendo il codice sorgente, gli errori runtime tracciando l'esecuzione del programma." ---

source: ## Use comments to add documentation to programs.
it: ## Usare i commenti per aggiungere documentazione ai programmi.

source: ~~~ # This sentence isn't executed by Python. adjustment = 0.5 # Neither is this - anything after '#' is ignored. ~~~
it: ~~~ # Questa frase non verrà eseguita da Python. adjustment = 0.5 # Nemmeno questa: tutto ciò che si trova dopo un '#' viene ignorato. ~~~

source: ## A function may take zero or more arguments.
it: ## Una funzione può ricevere zero o più argomenti.
