Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: > > In the JupyterLab Main Work Area you can arrange documents into panels of tabs. Here is an > example from the [official documentation][jupyterlab]. > > <p align='center'> > <img alt="Multi-panel JupyterLab" src="../fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > First, create a text file, Python console, and terminal window and arrange then into three > panels in the main work area. Next, create a notebook, terminal window, and text file and > arrange then into three panels in the main work area. Finally, create your own combination of > panels and tabs. What combination of panels and tabs do you think will be most useful for your > workflow? > > > ## Solution > > > > After creating the necessary tabs, you can drag one of the tabs to the center of a panel to > > move the tab to the panel; next you can subdivide a tab panel by dragging a tab to the left, > > right, top, or bottom of the panel.
it: > > Nell'area di lavoro principale di JupyterLab, si possono disporre i documenti in pannelli di schede. > Ecco un esempio dalla [documentazione ufficiale][jupyterlab]. > > <p align='center'> > <img alt="Multi-panel JupyterLab" src="../fig/0_multipanel_jupyterlab_screenshot.png" width="750"/> > </p> > > Innanzitutto, crea un file di testo, una console Python e una finestra di terminale, e sistemale in tre > pannelli nell'area di lavoro principale. Poi, crea un notebook, una finestra di terminale e un file di > testo, e sistemali in tre pannelli nell'area di lavoro principale. Infine, crea una combinazione a scelta > di pannelli e schede. Qual è la combinazione di pannelli e schede che pensi ti sarà più utile per il > tuo flusso di lavoro? > > > ## Soluzione > > > > Dopo aver creato le schede necessarie, puoi trascinarne una al centro di un pannello per spostare > > la scheda nel pannello; poi, puoi suddividere un pannello trascinando una scheda verso sinistra, > > verso destra, verso l'alto o verso il basso all'interno del pannello.

source: ## Use the Jupyter Notebook for editing and running Python.
it: ## Usare il Jupyter Notebook per scrivere e eseguire codice Python.

source: * While it's common to write Python scripts using a text editor, we are going to use the [Jupyter Notebook][jupyter] for the remainder of this workshop.
it: * Sebbene sia comune scrivere script in Python usando un editor di testo, per questo corso useremo [Jupyter Notebook][jupyter] da qui in avanti.

source: * This has several advantages:
it: * Ci sono diversi vantaggi:

source: * You can easily type, edit, and copy and paste blocks of code.
it: * È facile digitare, modificare, copiare e incollare blocchi di codice.

source: * Tab complete allows you to easily access the names of things you are using
it: * L'autocompletamento (premendo il tasto *tab*) permette di visualizzare facilmente i nomi degli elementi in uso

source: and learn more about them. * It allows you to annotate your code with links, different sized text, bullets, etc. to make it more accessible to you and your collaborators. * It allows you to display figures next to the code that produces them to tell a complete story of the analysis. * Each notebook contains one or more cells that contain code, text, or images.
it: e di saperne di più. * Permette di annotare il codice con link, testo di dimensioni diverse, elenchi puntati, ecc. per renderlo più facilmente comprensibile a te e ai tuoi collaboratori. * Ti permette di mostrare le figure insieme al codice che le genera, così da dare una narrazione completa delle tue analisi. * Ogni notebook contiene una o più celle con codice, testo o immagini.

source: > ## Code vs. Text
it: > ## Distinguere codice e testo

source: > > Jupyter mixes code and text in different types of blocks, called cells. We often use the term > "code" to mean "the source code of software written in a language such as Python". > A "code cell" in a Notebook is a cell that contains software; > a "text cell" is one that contains ordinary prose written for human beings.
it: > > Jupyter mescola codice e testo in blocchi di tipo diverso, chiamate celle. In genere, usiamo il termine > "codice" nel senso di "codice sorgente di un software, scritto in un linguaggio come Python". > Una "cella di codice" ("code cell") in un Notebook è una cella che contiene software; > una "cella di testo" ("text cell"), al contrario, contiene prosa ordinaria, scritta per essere letta da umani.

source: ## The Notebook has Command and Edit modes.
it: ## Il Notebook ha le modalità Comando e Modifica.

source: * If you press <kbd>Esc</kbd> and <kbd>Return</kbd> alternately, the outer border of your code cell will change from gray to blue.
it: * Premendo <kbd>Esc</kbd> e <kbd>Invio</kbd> in alternanza, il bordo esterno di una cella di codice cambia da grigio a blu.

source: * These are the **Command** (gray) and **Edit** (blue) modes of your notebook.
it: * Queste sono le modalità **Comando** (grigio) e **Modifica** (blu) del notebook.

source: * Command mode allows you to edit notebook-level features, and Edit mode changes the content of cells.
it: * La modalità Comando consente di agire su proprietà globali del notebook, mentre la modalità Modifica cambia i contenuti della cella.

source: * When in Command mode (esc/gray),
it: * Quando in modalità Comando (esc/grigio),

source: * The <kbd>b</kbd> key will make a new cell below the currently selected cell.
it: * Il tasto <kbd>b</kbd>crea una nuova cella al di sotto di quella attualmente selezionata.

source: * The <kbd>a</kbd> key will make one above.
it: * Il tasto <kbd>a</kbd> ne crea una al di sopra.

source: * The <kbd>x</kbd> key will delete the current cell.
it: * Il tasto <kbd>x</kbd> elimina la cella selezionata.

source: * The <kbd>z</kbd> key will undo your last cell operation (which could be a deletion, creation, etc).
it: * Il tasto <kbd>z</kbd> annulla la tua ultima operazione sulle celle (come l'eliminazione o creazione di una cella, ecc.).

source: * All actions can be done using the menus, but there are lots of keyboard shortcuts to speed things up.
it: * Tutte queste azioni possono essere svolte anche usando i menù, ma ci sono molte scorciatoie da tastiera per rendere le operazioni più rapide.

source: > ## Command Vs. Edit
it: > ## La differenza tra modalità Comando e Modifica

source: > > In the Jupyter notebook page are you currently in Command or Edit mode? > Switch between the modes. > Use the shortcuts to generate a new cell. > Use the shortcuts to delete a cell. > Use the shortcuts to undo the last cell operation you performed. > > > ## Solution > > > > Command mode has a grey border and Edit mode has a blue border. > > Use <kbd>Esc</kbd> and <kbd>Return</kbd> to switch between modes. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>b</kbd> or <kbd>a</kbd>. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>x</kbd>. > > You need to be in Command mode (Press <kbd>Esc</kbd> if your cell is blue). Type <kbd>z</kbd>.
it: > > Nella tua pagina Jupyter Notebook, ti trovi in modalità Comando o Modifica, al momento? > Passa da una modalità all'altra. > Usa le scorciatoie da tastiera per creare una nuova cella. > Usa le scorciatoie per eliminare una cella. > Usa le scorciatorie per annullare la tua ultima operazione. > > > ## Soluzione > > > > La modalità Comando ha un contorno grigio, mentre Modifica ha un contorno blu. > > Usa <kbd>Esc</kbd> e <kbd>Invio</kbd> per passare da una all'altra. > > Assicurati di essere in modalità Comando (Premi <kbd>Esc</kbd> se la cella è blu). Digita <kbd>b</kbd> oppure <kbd>a</kbd>. > > Assicurati di essere in modalità Comando (Premi 3Esc3 se la cella è blu). Digita <kbd>x</kbd>. > > Assicurati di essere in modalità Comando (Premi 3Esc3 se la cella è blu). Digita <kbd>z</kbd>.

source: ### Use the keyboard and mouse to select and edit cells.
it: ### Usare tastiera e mouse per selezionare e modificare celle.

source: * Pressing the <kbd>Return</kbd> key turns the border blue and engages Edit mode, which allows
it: * Premendo<kbd>Invio</kbd>, il bordo della cella diventa blu, e la modalità Modifica è attiva, permettendo

source: you to type within the cell. * Because we want to be able to write many lines of code in a single cell, pressing the <kbd>Return</kbd> key when in Edit mode (blue) moves the cursor to the next line in the cell just like in a text editor. * We need some other way to tell the Notebook we want to run what's in the cell. * Pressing <kbd>Shift</kbd>+<kbd>Return</kbd> together will execute the contents of the cell. * Notice that the <kbd>Return</kbd> and <kbd>Shift</kbd> keys on the right of the keyboard are right next to each other.
it: di scrivere all'interno della cella. * Poiché vogliamo poter scrivere più di una riga di codice in ogni cella, premere il tasto <kbd>Invio</kbd> in modalità Modifica muove il cursore alla riga sucessiva all'interno della cella, come in un editor di testo. * Per comunicare al Notebook che vogliamo eseguire il codice presente nella cella, dobbiamo usare un altro metodo. * Premendo <kbd>Shift</kbd>+<kbd>Invio</kbd>insieme, il computer esegue il contenuto della cella. * Notare che il tasto <kbd>Invio</kbd> e il tasto <kbd>Shift</kbd> di destra sono uno accanto all'altro sulla tastiera.

source: ### The Notebook will turn Markdown into pretty-printed documentation.
it: ### Il Notebook converte codice Markdown in documentazione graficamente curata.

source: * Notebooks can also render [Markdown][markdown].
it: * Il notebook può anche visualizzare [Markdown][markdown].

source: * A simple plain-text format for writing lists, links,
it: * Un formato di testo semplice, usato per scrivere liste, link,

source: and other things that might go into a web page. * Equivalently, a subset of HTML that looks like what you'd send in an old-fashioned email. * Turn the current cell into a Markdown cell by entering the Command mode (<kbd>Esc</kbd>/gray) and press the <kbd>M</kbd> key. * `In [ ]:` will disappear to show it is no longer a code cell and you will be able to write in Markdown. * Turn the current cell into a Code cell by entering the Command mode (<kbd>Esc</kbd>/gray) and press the <kbd>y</kbd> key.
it: e altri elementi come in una pagina web. * In altre parole, un sottoinsieme dell'HTML simile a quello che si può mandare in una cara, vecchia, email. * Per trasformare la cella selezionata in una cella Markdown, entra in modalità Comando (<kbd>Esc</kbd>/grigio) e premi il tasto <kbd>M</kbd> . * `In [ ]:` scompare, indicando che non è più una cella di codice, e si può usare per scrivere Markdown. * Per trasformare la cella selezionata in una cella di codice, entra in modalità Comando (<kbd>Esc</kbd>/grigio) e premi il tasto <kbd>Y</kbd> .

source: ### Markdown does most of what HTML does.
it: ### Il Markdown permette di fare molte cose tipiche dell'HTML.

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Use asterisks * to create * bullet lists. ~~~ </div> <div class="col-md-6" markdown="1"> * Use asterisks * to create * bullet lists. </div> </div>
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Usa degli asterischi * per creare * elenchi puntati. ~~~ </div> <div class="col-md-6" markdown="1"> * Usa degli asterischi * per creare * elenchi puntati. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ 1. Use numbers 1. to create 1. numbered lists. ~~~ </div> <div class="col-md-6" markdown="1"> 1. Use numbers 1. to create 1. numbered lists. </div> </div>
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ 1. Usa dei numeri 1. per creare 1. elenchi numerati. ~~~ </div> <div class="col-md-6" markdown="1"> 1. Usa dei numeri 1. per creare 1. elenchi numerati. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * You can use indents * To create sublists * of the same type * Or sublists 1. Of different 1. types ~~~ </div> <div class="col-md-6" markdown="1"> * You can use indents * To create sublists * of the same type * Or sublists 1. Of different 1. types </div> </div>
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ * Usa l'indentazione * Per creare sotto-elenchi * dello stesso tipo * Oppure 1. Di un altro 1. tipo ~~~ </div> <div class="col-md-6" markdown="1"> * Usa l'indentazione * Per creare sotto-elenchi * dello stesso tipo * Oppure 1. Di un altro 1. tipo </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ # A Level-1 Heading ~~~ </div> <div class="col-md-6" markdown="1"> # A Level-1 Heading </div> </div>
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ # Un titolo di primo livello ~~~ </div> <div class="col-md-6" markdown="1"> # Un titolo di primo livello </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ ## A Level-2 Heading (etc.) ~~~ </div> <div class="col-md-6" markdown="1"> ## A Level-2 Heading (etc.) </div> </div>
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ ## Un titolo di secondo livello (ecc.) ~~~ </div> <div class="col-md-6" markdown="1"> ## Un titolo di secondo livello (ecc.) </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ Line breaks don't matter.
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ La presenza di ritorni a capo non ha importanza.

source: But blank lines create new paragraphs. ~~~ </div> <div class="col-md-6" markdown="1"> Line breaks don't matter.
it: Ma righe lasciate vuote danno luogo a un nuovo paragrafo. ~~~ </div> <div class="col-md-6" markdown="1"> La presenza di ritorni a capo non ha importanza.

source: But blank lines create new paragraphs. </div> </div>
it: Ma righe lasciate vuote danno luogo a un nuovo paragrafo. </div> </div>

source: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ [Create links](http://software-carpentry.org) with `[...](...)`. Or use [named links][data_carpentry].
it: <div class="row"> <div class="col-md-6" markdown="1"> ~~~ Per [creare link](http://software-carpentry.org) si scrive `[...](...)`. O si possono usare [link nominali][data_carpentry].

source: [data_carpentry]: http://datacarpentry.org ~~~ </div> <div class="col-md-6" markdown="1"> [Create links](http://software-carpentry.org) with `[...](...)`. Or use [named links][data_carpentry].
it: [data_carpentry]: http://datacarpentry.org ~~~ </div> <div class="col-md-6" markdown="1"> Per [creare link](http://software-carpentry.org) si scrive `[...](...)`. O si possono usare [link nominali][data_carpentry].

source: > ## Creating Lists in Markdown
it: > ## Creare elenchi in Markdown

source: > > Create a nested list in a Markdown cell in a notebook that looks like this: > > 1. Get funding. > 2. Do work. > * Design experiment. > * Collect data. > * Analyze. > 3. Write up. > 4. Publish. > > > ## Solution > > > > This challenge integrates both the numbered list and bullet list. > > Note that the bullet list is indented 2 spaces so that it is inline with the items of the numbered list. > > ~~~ > > 1. Get funding. > > 2. Do work. > > * Design experiment. > > * Collect data. > > * Analyze. > > 3. Write up. > > 4. Publish. > > ~~~
it: > > Crea una lista in Markdown con questo aspetto: > > 1. Ottenere finanziamenti. > 2. Lavorare. > * Progettare gli esperimenti. > * Raccogliere dati. > * Analizzarli. > 3. Scrivere il resoconto. > 4. Pubblicare. > > > ## Soluzione > > > > Questo esercizio contiene sia elenchi puntati sia numerati. > > Notare che l'elenco puntato è indentato di due spazi in modo da essere allineato con gli elementi dell'elenco numerato. > > ~~~ > > 1. Ottenere finanziamenti. > > 2. Lavorare. > > * Progettare gli esperimenti. > > * Raccogliere dati. > > * Analizzarli. > > 3. Scrivere il resoconto. > > 4. Pubblicare. > > ~~~

source: > ## More Math
it: > ## Ancora matematica

source: > > What is displayed when a Python cell in a notebook > that contains several calculations is executed? > For example, what happens when this cell is executed? > > ~~~ > 7 * 3 > 2 + 1 > ~~~ > {: .language-python} > > > ## Solution > > > > Python returns the output of the last calculation. > > ~~~ > > 3 > > ~~~ > > {: .language-python}
it: > > Quando si esegue una cella di codice Python che contiene > diversi calcoli, cosa viene mostrato come risultato? > Per esempio, cosa succede quando eseguiamo questa cella? > > ~~~ > 7 * 3 > 2 + 1 > ~~~ > {: .language-python} > > > ## Soluzione > > > > Python ci mostra solo il risultato dell'ultimo calcolo. > > ~~~ > > 3 > > ~~~ > > {: .language-python}

source: > ## Change an Existing Cell from Code to Markdown
it: > ## Cambiare una cella esistente da Codice a Markdown

source: > > What happens if you write some Python in a code cell > and then you switch it to a Markdown cell? > For example, > put the following in a code cell: > > ~~~ > x = 6 * 7 + 12 > print(x) > ~~~ > {: .language-python} > > And then run it with <kbd>Shift</kbd>+<kbd>Return</kbd> to be sure that it works as a code cell. > Now go back to the cell and use <kbd>Esc</kbd> then <kbd>m</kbd> to switch the cell to Markdown > and "run" it with <kbd>Shift</kbd>+<kbd>Return</kbd>. > What happened and how might this be useful? > > > ## Solution > > > > The Python code gets treated like Markdown text. > > The lines appear as if they are part of one contiguous paragraph. > > This could be useful to temporarily turn on and off cells in notebooks that get used for multiple purposes. > > ~~~ > > x = 6 * 7 + 12 print(x) > > ~~~ > > {: .language-python}
it: > > Cosa succede se si scrive Python in una cella di codice, > e poi la si cambia in una cella Markdown? > Per esempio, > scrivi il codice seguente in una cella di codice: > > ~~~ > x = 6 * 7 + 12 > print(x) > ~~~ > {: .language-python} > > Poi eseguila con <kbd>Shift</kbd>+<kbd>Invio</kbd> per accertarti che funzioni come cella di codice. > Ora, torna indietro e usa <kbd>Esc</kbd> seguito da <kbd>m</kbd> per convertirla in una cella Markdown > e "eseguila" con <kbd>Shift</kbd>+<kbd>Invio</kbd>. > Cosa è successo? In che modo il risultato può essere utile? > > > ## Soluzione > > > > Il codice Python viene trattato come testo Markdown. > > Le righe appaiono come un paragrafo unico. > > Può essere utile per "attivare" e "disattivare" alcune celle, in notebook che sono usati per scopi diversi. > > ~~~ > > x = 6 * 7 + 12 print(x) > > ~~~ > > {: .language-python}

source: > ## Equations
it: > ## Equazioni

source: > > Standard Markdown (such as we're using for these notes) won't render equations, > but the Notebook will. > Create a new Markdown cell > and enter the following: > > ~~~ > $\sum_{i=1}^{N} 2^{-i} \approx 1$ > ~~~ > > (It's probably easier to copy and paste.) > What does it display? > What do you think the underscore, `_`, circumflex, `^`, and dollar sign, `$`, do? > > > ## Solution > > > > The notebook shows the equation as it would be rendered from LaTeX equation syntax. > > The dollar sign, `$`, is used to tell Markdown that the text in between is a LaTeX equation. > > If you're not familiar with LaTeX, underscore, `_`, is used for subscripts and circumflex, `^`, is used for superscripts. > > A pair of curly braces, `{` and `}`, is used to group text together so that the statement `i=1` becomes the subscript and `N` becomes the superscript. > > Similarly, `-i` is in curly braces to make the whole statement the superscript for `2`. > > `\sum` and `\approx` are LaTeX commands for "sum over" and "approximate" symbols.
it: > > Standard Markdown (l'implementazione di Markdown usata in queste note) non è in grado di visualizzare equazioni, > ma il notebook può. > Crea una nuova cella Markdown > e inserisci quanto segue: > > ~~~ > $\sum_{i=1}^{N} 2^{-i} \approx 1$ > ~~~ > > (Potrebbe essere più comodo copiare e incollare.) > Che cosa mostra? > A cosa pensi servano il trattino basso, `_`, l'accento circonflesso, `^` e il simbolo del dollaro, `$`? > > > ## Soluzione > > > > Il notebook ci mostra l'equazione interpretata come sintassi di equazione LaTeX. > > Il simbolo del dollaro, `$`, si usa per dire all'interprete Markdown che il contenuto è un'equazione LaTeX. > > Se non conosci LaTeX, il trattino basso, `_`, si usa per i pedici, e il circonflesso, `^`, si usa per gli apici. > > Una coppia di parentesi graffe, `{` and `}`, si usa per raggruppare elementi assieme, in modo che `i=1` sia tutto un pedice, e `N` sia l'apice. > > Analogamente, `-i` è in parentesi graffe in modo che tutta l'espressione sia l'esponente di `2`. > > `\sum` e `\approx` sono comandi LaTeX per i simboli di sommatoria e di "approssimativamente".

source: ## Closing JupyterLab
it: ## Chiudere JupyterLab

source: * From the Menu Bar select the "File" menu and the choose "Quit" at the bottom of the dropdown menu. You will be prompted to confirm that you wish to shutdown the JupyterLab server (don't forget to save your work!). Click "Confirm" to shutdown the JupyterLab server.
it: * Dalla barra dei menù, seleziona il menù "File" e scegli "Quit" (esci) in fondo al menù a comparsa. Ti verrà chiesto di confermare che vuoi spegnere il server JupyterLab (non dimenticare di salvare il lavoro fatto!). Clicca su "Confirm" (conferma) per spegnere il server JupyterLab.

source: * To restart the JupyterLab server you will need to re-run the following command from a shell.
it: * Per riaccendere un server JupyterLab, sarà necessario dare nuovamente il comando seguente in una shell.

source: > ## Closing JupyerLab
it: > ## Chiudere JupyterLab

source: > > Practice closing and restarting the JupyterLab server.
it: > > Esercitati a chiudere e riaprire il server JupyterLab.

source: --- title: "Variables and Assignment" teaching: 10 exercises: 10 questions: - "How can I store data in programs?" objectives: - "Write programs that assign scalar values to variables and perform calculations with those values." - "Correctly trace value changes in programs that use scalar assignment." keypoints: - "Use variables to store values." - "Use `print` to display values." - "Variables persist between cells." - "Variables must be created before they are used." - "Variables can be used in calculations." - "Use an index to get a single character from a string." - "Use a slice to get a substring." - "Use the built-in function `len` to find the length of a string." - "Python is case-sensitive." - "Use meaningful variable names." ---
it: --- title: "Variabili e valori" teaching: 10 exercises: 10 questions: - "Come vengono registrati i dati nei programmi?" objectives: - "Scrivere programmi che assegnano valori numerici alle variabili, e li usano per fare calcoli." - "Saper tenere traccia di come cambiano i valori delle variabili in programmi che assegnano valori numerici." keypoints: - "Usare le variabili per tenere valori in memoria." - "Usare `print` per visualizzare i valori." - "Le variabili restano accessibili da una cella all'altra." - "Le variabili devono essere definite prima di essere usate." - "Le variabili si possono usare per fare calcoli." - "Usare un indice per estrarre un singolo carattere da una stringa." - "Usare una slice per estrarre una sotto-stringa." - "Usare la funzione predefinita `len` per sapere la lunghezza di una stringa." - "Python distingue tra maiuscole e minuscole." - "Usare nomi sensati per le variabili." ---

source: ## Use variables to store values.
it: ## Usare le variabili per tenere valori in memoria

source: * **Variables** are names for values.
it: * Le **variabili** sono nomi associati a valori.

source: * In Python the `=` symbol assigns the value on the right to the name on the left.
it: * In Python, il simbolo `=` assegna il valore sulla destra al nome sulla sinistra.

source: * The variable is created when a value is assigned to it.
it: * La variabile viene creata non appena le è assegnato un valore.
