Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: > > After reading the data for the Americas, > use `help(americas.head)` and `help(americas.tail)` > to find out what `DataFrame.head` and `DataFrame.tail` do. > > 1. What method call will display the first three rows of this data? > 2. What method call will display the last three columns of this data? > (Hint: you may need to change your view of the data.) > > > ## Solution > > 1. We can check out the first five rows of `americas` by executing `americas.head()` (allowing us to view the head > > of the DataFrame). We can specify the number of rows we wish to see by specifying the parameter `n` in our call > > to `americas.head()`. To view the first three rows, execute: > > > > ~~~ > > americas.head(n=3) > > ~~~ > >{: .language-python} > > > > The output is then > > ~~~ > > continent gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 \ > >country > >Argentina Americas 5911.315053 6856.856212 7133.166023 > >Bolivia Americas 2677.326347 2127.686326 2180.972546 > >Brazil Americas 2108.944355 2487.365989 3336.585802 > > > > gdpPercap_1967 gdpPercap_1972 gdpPercap_1977 gdpPercap_1982 \ > >country > >Argentina 8052.953021 9443.038526 10079.026740 8997.897412 > >Bolivia 2586.886053 2980.331339 3548.097832 3156.510452 > >Brazil 3429.864357 4985.711467 6660.118654 7030.835878 > > > > gdpPercap_1987 gdpPercap_1992 gdpPercap_1997 gdpPercap_2002 \ > >country > >Argentina 9139.671389 9308.418710 10967.281950 8797.640716 > >Bolivia 2753.691490 2961.699694 3326.143191 3413.262690 > >Brazil 7807.095818 6950.283021 7957.980824 8131.212843 > > > > gdpPercap_2007 > >country > >Argentina 12779.379640 > >Bolivia 3822.137084 > >Brazil 9065.800825 > > ~~~ > >{: .output} > > 2. To check out the last three rows of `americas`, we would use the command, `americas.tail(n=3)`, > > analogous to `head()` used above. However, here we want to look at the last three columns so we need > > to change our view and then use `tail()`. To do so, we create a new DataFrame in which rows and > > columns are switched > > > > ~~~ > > americas_flipped = americas.T > > ~~~ > >{: .language-python} > > > > We can then view the last three columns of `americas` by viewing the last three rows of `americas_flipped`: > > ~~~ > > americas_flipped.tail(n=3) > > ~~~ > >{: .language-python} > > The output is then > > ~~~ > > country Argentina Bolivia Brazil Canada Chile Colombia \ > > gdpPercap_1997 10967.3 3326.14 7957.98 28954.9 10118.1 6117.36 > > gdpPercap_2002 8797.64 3413.26 8131.21 33329 10778.8 5755.26 > > gdpPercap_2007 12779.4 3822.14 9065.8 36319.2 13171.6 7006.58 > > > > country Costa Rica Cuba Dominican Republic Ecuador ... \ > > gdpPercap_1997 6677.05 5431.99 3614.1 7429.46 ... > > gdpPercap_2002 7723.45 6340.65 4563.81 5773.04 ... > > gdpPercap_2007 9645.06 8948.1 6025.37 6873.26 ... > > > > country Mexico Nicaragua Panama Paraguay Peru Puerto Rico \ > > gdpPercap_1997 9767.3 2253.02 7113.69 4247.4 5838.35 16999.4 > > gdpPercap_2002 10742.4 2474.55 7356.03 3783.67 5909.02 18855.6 > > gdpPercap_2007 11977.6 2749.32 9809.19 4172.84 7408.91 19328.7 > > > > country Trinidad and Tobago United States Uruguay Venezuela > > gdpPercap_1997 8792.57 35767.4 9230.24 10165.5 > > gdpPercap_2002 11460.6 39097.1 7727 8605.05 > > gdpPercap_2007 18008.5 42951.7 10611.5 11415.8 > > ~~~ > >{: .output} > > Note: we could have done the above in a single line of code by 'chaining' the commands: > > ~~~ > > americas.T.tail(n=3) > > ~~~ > >{: .language-python}
it: > > Dopo aver letto dal file i dati relativi alle Americhe, > usa `help(americas.head)` e `help(americas.tail)` > per scoprire a cosa servono `DataFrame.head` e `DataFrame.tail`. > > 1. Con quale chiamata si possono visualizzare le prime tre righe di questa tabella? > 2. Con quale chiamata si possono visualizzare le ultime tre colonne di questa tabella? > (Suggerimento: può essere utile invertire la 'vista' sul dataset.) > > > ## Soluzione > > 1. Possiamo dare un'occhiata alle prime cinque righe di `americas` eseguendo `americas.head()` (che ci permette di vedere la 'testa' > > del DataFrame). Possiamo specificare il numero di righe che desideriamo visualizzare, specificando il parametro `n` nella nostra chiamata > > a `americas.head()`. Per visualizzare le prime tre righe, esegui: > > > > ~~~ > > americas.head(n=3) > > ~~~ > >{: .language-python} > > > > In questo caso il risultato è > > ~~~ > > continent gdpPercap_1952 gdpPercap_1957 gdpPercap_1962 \ > >country > >Argentina Americas 5911.315053 6856.856212 7133.166023 > >Bolivia Americas 2677.326347 2127.686326 2180.972546 > >Brazil Americas 2108.944355 2487.365989 3336.585802 > > > > gdpPercap_1967 gdpPercap_1972 gdpPercap_1977 gdpPercap_1982 \ > >country > >Argentina 8052.953021 9443.038526 10079.026740 8997.897412 > >Bolivia 2586.886053 2980.331339 3548.097832 3156.510452 > >Brazil 3429.864357 4985.711467 6660.118654 7030.835878 > > > > gdpPercap_1987 gdpPercap_1992 gdpPercap_1997 gdpPercap_2002 \ > >country > >Argentina 9139.671389 9308.418710 10967.281950 8797.640716 > >Bolivia 2753.691490 2961.699694 3326.143191 3413.262690 > >Brazil 7807.095818 6950.283021 7957.980824 8131.212843 > > > > gdpPercap_2007 > >country > >Argentina 12779.379640 > >Bolivia 3822.137084 > >Brazil 9065.800825 > > ~~~ > >{: .output} > > 2. Per dare un'occhiata alle ultime tre righe di `americas`, usiamo il comando `americas.tail(n=3)`, > > che è analogo a `head()`. Però, in questo caso vogliamo le ultime tre *colonne*, per cui dobbiamo > > cambiare la 'vista' e usare `tail()`. A questo scopo, creiamo un nuovo > > DataFrame in cui righe e colonne sono scambiate. > > > > ~~~ > > americas_invertito = americas.T > > ~~~ > >{: .language-python} > > > > Poi, possiamo visualizzare le ultime tre colonne di `americas` guardando le ultime tre righe di `americas_invertito`: > > ~~~ > > americas_invertito.tail(n=3) > > ~~~ > >{: .language-python} > > E allora il risultato è > > ~~~ > > country Argentina Bolivia Brazil Canada Chile Colombia \ > > gdpPercap_1997 10967.3 3326.14 7957.98 28954.9 10118.1 6117.36 > > gdpPercap_2002 8797.64 3413.26 8131.21 33329 10778.8 5755.26 > > gdpPercap_2007 12779.4 3822.14 9065.8 36319.2 13171.6 7006.58 > > > > country Costa Rica Cuba Dominican Republic Ecuador ... \ > > gdpPercap_1997 6677.05 5431.99 3614.1 7429.46 ... > > gdpPercap_2002 7723.45 6340.65 4563.81 5773.04 ... > > gdpPercap_2007 9645.06 8948.1 6025.37 6873.26 ... > > > > country Mexico Nicaragua Panama Paraguay Peru Puerto Rico \ > > gdpPercap_1997 9767.3 2253.02 7113.69 4247.4 5838.35 16999.4 > > gdpPercap_2002 10742.4 2474.55 7356.03 3783.67 5909.02 18855.6 > > gdpPercap_2007 11977.6 2749.32 9809.19 4172.84 7408.91 19328.7 > > > > country Trinidad and Tobago United States Uruguay Venezuela > > gdpPercap_1997 8792.57 35767.4 9230.24 10165.5 > > gdpPercap_2002 11460.6 39097.1 7727 8605.05 > > gdpPercap_2007 18008.5 42951.7 10611.5 11415.8 > > ~~~ > >{: .output} > > Nota: avremmo potuto fare lo stesso in una sola riga di codice, mettendo i comandi in fila: > > ~~~ > > americas.T.tail(n=3) > > ~~~ > >{: .language-python}

source: > ## Reading Files in Other Directories
it: > ## Leggere file in altre cartelle

source: > > The data for your current project is stored in a file called `microbes.csv`, > which is located in a folder called `field_data`. > You are doing analysis in a notebook called `analysis.ipynb` > in a sibling folder called `thesis`: > > ~~~ > your_home_directory > +-- field_data/ > | +-- microbes.csv > +-- thesis/ > +-- analysis.ipynb > ~~~
it: > > I dati usati nel progetto a cui stai lavorando sono salvati in un file chiamato `microbi.csv`, > che si trova in una cartella chiamata `dati_sperimentali`. > Stai facendo le tue analisi in un notebook chiamato `analisi.ipynb` > in una cartella di fianco, chiamata `tesi`: > > ~~~ > cartella_principale > +-- dati_sperimentali/ > | +-- microbi.csv > +-- tesi/ > +-- analisi.ipynb > ~~~

source: > > What value(s) should you pass to `read_csv` to read `microbes.csv` in `analysis.ipynb`? > > > ## Solution > > We need to specify the path to the file of interest in the call to `pd.read_csv`. We first need to 'jump' out of > > the folder `thesis` using '../' and then into the folder `field_data` using 'field_data/'. Then we can specify the filename `microbes.csv. > > The result is as follows: > > ~~~ > > data_microbes = pd.read_csv('../field_data/microbes.csv') > > ~~~ > >{: .language-python}
it: > > Che valore o valori bisogna passare a `read_csv` per leggere `microbi.csv` dal notebook `analisi.ipynb`? > > > ## Soluzione > > Nella chiamata a `pd.read_csv`, dobbiamo specificare il percorso per arrivare al file che ci interessa. Prima di tutto, dobbiamo 'uscire' dalla cartella > > `tesi` usando '../', e poi entrare nella cartella `dati_sperimentali` usando 'dati_sperimentali/'. Solo allora possiamo specificare il nome del file `microbi.csv. > > Il risultato è il seguente: > > ~~~ > > data_microbi = pd.read_csv('../dati_sperimentali/microbi.csv') > > ~~~ > >{: .language-python}

source: > ## Writing Data
it: > ## Salvare dati su disco

source: > As well as the `read_csv` function for reading data from a file,
it: > Cosò come esiste una funzione `read_csv` per leggere dati da un file,

source: > Pandas provides a `to_csv` function to write dataframes to files.
it: > Pandas contiene una funzione `to_csv` per salvare i dataframe su file.

source: > Applying what you've learned about reading from files,
it: > Usando ciò che hai imparato riguardo alla lettura dei file,

source: > write one of your dataframes to a file called `processed.csv`.
it: > salva uno dei tuoi dataframe in un file chiamato `dati_lavorati.csv`.

source: > You can use `help` to get information on how to use `to_csv`.
it: > Per sapere come usare la funzione `to_csv`, puoi usare `help`.

source: > > ## Solution
it: > > ## Soluzione

source: > > In order to write the DataFrame `americas` to a file called `processed.csv`, execute the following command:
it: > > Per salvare il DataFrame `americas` in un file chiamato `dati_lavorati.csv`, esegui il comando seguente:

source: > > americas.to_csv('processed.csv')
it: > > americas.to_csv('dati_lavorati.csv')

source: > > For help on `to_csv`, you could execute, for example,
it: > > Per leggere l'aiuto relativo a `to_csv`, puoi, ad esempio, eseguire,

source: > > Note that `help(to_csv)` throws an error! This is a subtlety and is due to the fact that `to_csv` is NOT a function in
it: > > Osserva che `help(to_csv)` dà un errore! Questa è una sottigliezza, dovuta al fatto che `to_csv` NON è una funzione indipendente, ma un metodo,

source: > > and of itself and the actual call is `americas.to_csv`.
it: > > e la chiamata corretta è `americas.to_csv`.

source: --- title: "Plotting" teaching: 15 exercises: 15 questions: - "How can I plot my data?" - "How can I save my plot for publishing?" objectives: - "Create a time series plot showing a single data set." - "Create a scatter plot showing relationship between two data sets." keypoints: - "[`matplotlib`](https://matplotlib.org/) is the most widely used scientific plotting library in Python." - "Plot data directly from a Pandas dataframe." - "Select and transform data, then plot it." - "Many styles of plot are available: see the [Python Graph Gallery](https://python-graph-gallery.com/matplotlib/) for more options." - "Can plot many sets of data together." ---
it: --- title: "Grafici" teaching: 15 exercises: 15 questions: - "Come si mostrano i dati in un grafico?" - "Come si salvano i grafici per pubblicarli?" objectives: - "Creare un grafico di una serie temporale con un singolo dataset." - "Creare un grafico a dispersione che mostra la relazione tra due dataset." keypoints: - "[`matplotlib`](https://matplotlib.org/) è la libreria più usata per i grafici scientifici in Python." - "Si possono creare grafici direttamente da dataframe di Pandas." - "Selezionare e trasformare dati prima di creare un grafico." - "Sono disponibili molti tipi di grafico: vedi la [Python Graph Gallery](https://python-graph-gallery.com/matplotlib/) per tutte le altre possibilità." - "Si possono rappresentare molti dataset nello stesso grafico." ---

source: --- layout: break title: "Lunch" teaching: 0 exercises: 0 break: 45 ---
it: --- layout: break title: "Pranzo" teaching: 0 exercises: 0 break: 45 ---

source: Over lunch, reflect on and discuss the following: * What sort of packages might you use in Python and why would you use them? * How would data need to be formatted to be used in Pandas data frames? Would the data you have meet these requirements? * What limitations or problems might you run into when thinking about how to apply what we've learned to your own projects or data?
it: Durante il pranzo, rifletti e discuti i punti seguenti: * Che tipo di pacchetti in Python potrebbero esserti utili, e perché? * Come devono essere strutturati i dati, per poter essere usati nei dataframe di Pandas? I dati che possiedi soddisfano questi requisiti? * Pensando a come applicare ai tuoi progetti o ai tuoi dati ciò che abbiamo imparato, quali limitazioni o problemi potresti incontrare?

source: --- layout: break title: "Afternoon Coffee" teaching: 0 exercises: 0 break: 15 ---
it: --- layout: break title: "Pausa pomeridiana" teaching: 0 exercises: 0 break: 15 ---

source: Over break, reflect on and discuss the following: * A common refrain in software engineering is "Don't Repeat Yourself". How do the techniques we've learned in the last lessons help us avoid repeating ourselves? _note that in practice there is some nuance to this and should be balanced with doing the simplest thing that could possibly work_ * What are the pros / cons of making a variable global or local to a function? * When would you consider turning a block of code into a function definition?
it: Nel corso della pausa, rifletti e discuti su quanto segue: * Un detto comune nell'ingegneria del software è "non ripeterti". In che modo ciò che abbiamo appreso nelle ultime lezioni può aiutarci a non ripeterci? _considera che, nella pratica, non tutto è così netto, e deve esserci un equilibrio con la soluzione più semplice che funzioni_ * Quali sono i pro e i contro di definire una variabile globale o locale all'interno di una funzione? * In quali casi decideresti di prendere un blocco di codice e farlo diventare la definizione di una funzione?

source: --- title: "Wrap-Up" teaching: 20 exercises: 0 questions: - "What have we learned?" - "What else is out there and where do I find it?" objectives: - "Name and locate scientific Python community sites for software, workshops, and help." keypoints: - "Python supports a large and diverse community across academia and industry." ---
it: --- title: "Conclusione" teaching: 20 exercises: 0 questions: - "Che cosa abbiamo imparato?" - "Quali altre risorse esistono e dove posso trovarle?" objectives: - "Citare e trovare i siti della comunità scientifica Python, per software, laboratori e aiuto." keypoints: - "Python offre una comunità estesa e varia, sia nel mondo dell'università che in quello delle aziende." ---

source: Leslie Lamport once said, "Writing is nature's way of showing you how sloppy your thinking is." The same is true of programming: many things that seem obvious when we're thinking about them turn out to be anything but when we have to explain them precisely.
it: Leslie Lamport ha detto: "La scrittura è il modo che ha la natura di farti vedere com'è impreciso il tuo pensiero." Lo stesso vale per la programmazione: molte cose che sembrano ovvie quando ci pensiamo risultano essere tutt'altro che ovvie quando ci troviamo a doverle spiegare con precisione.

source: ## Python supports a large and diverse community across academia and industry.
it: ## Python offre una comunità estesa e varia, sia nel mondo dell'università che in quello delle aziende.

source: * The [Python 3 documentation](https://docs.python.org/3/) covers the core language
it: * La [documentazione di Python 3](https://docs.python.org/3/) (in inglese) copre il nucleo principale del linguaggio

source: and the standard library.
it: e la standard library (la libreria di funzioni predefinite).

source: * [PyCon](https://pycon.org/) is the largest annual conference for the Python community.
it: * [PyCon](https://pycon.org/) è il maggior congresso annuale per la comunità Python.

source: * [SciPy](https://scipy.org) is a rich collection of scientific utilities.
it: * [SciPy](https://scipy.org) è una ricca collezione di utilità scientifiche.

source: It is also the name of [a series of annual conferences](https://conference.scipy.org/).
it: È anche il nome di [una serie di congressi annuali](https://conference.scipy.org/).

source: * [Jupyter](https://jupyter.org) is the home of Project Jupyter.
it: * [Jupyter](https://jupyter.org) è il sito del progetto Jupyter.

source: * [Pandas](https://pandas.pydata.org) is the home of the Pandas data library.
it: * [Pandas](https://pandas.pydata.org) è il sito di Pandas, la libreria per la gestione dei dati.

source: * Stack Overflow's [general Python section](https://stackoverflow.com/questions/tagged/python?tab=Votes)
it: * La [sezione generica di Python](https://stackoverflow.com/questions/tagged/python?tab=Votes) su Stack Overflow

source: can be helpful, as well as the sections on [NumPy](https://stackoverflow.com/questions/tagged/numpy?tab=Votes), [SciPy](https://stackoverflow.com/questions/tagged/scipy?tab=Votes), and [Pandas](https://stackoverflow.com/questions/tagged/pandas?tab=Votes).
it: può essere utile, e lo stesso vale per le sezioni relative a [NumPy](https://stackoverflow.com/questions/tagged/numpy?tab=Votes), [SciPy](https://stackoverflow.com/questions/tagged/scipy?tab=Votes), and [Pandas](https://stackoverflow.com/questions/tagged/pandas?tab=Votes).

source: --- title: "Feedback" teaching: 0 exercises: 15 questions: - "How did the class go?" objectives: - "Gather feedback on the class" keypoints: - "We are constantly seeking to improve this course." ---
it: --- title: "Feedback" teaching: 0 exercises: 15 questions: - "Come è andato il corso?" objectives: - "Raccogliere feedback sul corso" keypoints: - "Cerchiamo di migliorare continuamente questo corso." ---

source: Gather feedback from participants.
it: Raccogliere il feedback dei partecipanti.

source: --- layout: page title: About permalink: /about/ ---
it: --- layout: page title: Informazioni permalink: /about/ ---

source: --- layout: page title: "Discussion" permalink: /discuss/ ---
it: --- layout: page title: "Discussione" permalink: /discuss/ ---

source: FIXME: general discussion and further reading for learners.
it: FIXME: discussione generale e indicazione di altre risorse da leggere per i partecipanti.

source: --- layout: page title: "Further Exercises" permalink: /exercises/ ---
it: --- layout: page title: "Ulteriori esercizi" permalink: /exercises/ ---

source: FIXME: exercises that don't fit into the regular schedule.
it: FIXME: esercizi che non ci stanno nel programma regolare.

source: --- title: Figures ---
it: --- title: Figure ---

source: --- layout: page title: "Instructors' Guide" permalink: /guide/ ---
it: --- layout: page title: "Guida per gli istruttori" permalink: /guide/ ---

source: ## General Notes
it: ## Considerazioni generali

source: It's all right not to get through the whole lesson. : This lesson is designed for people who have never programmed before, but any given class may include people with a wide range of prior experience. We have therefore included enough material to fill a full day if need be, but expect that many offerings will only get as far as the introduction to Pandas.
it: Non è un problema se non riuscite a completare l'intera lezione. : Questa lezione è progettata per chi non ha mai programmato prima, ma una classe comprenderà sempre persone con livelli di esperienza anche molto diversi. Pertanto, abbiamo incluso abbastanza materiale da riempire una giornata intera se necessario, ma ci aspettiamo che in molti casi, l'offerta formativa si fermerà all'Introduzione a Pandas.

source: Don't tell people to Google things. : One of the goals of this lesson is to help novices build a workable mental model of how programming works. Until they have that model, they will not know what to search for or how to recognize a helpful answer. Telling them to Google can also give the impression that we think their problem is trivial. (That said, if learners have done enough programming before to be past these issues, having them search for solutions online can help them solidify their understanding.) It's also worth quoting [Trevor King](https://github.com/swcarpentry/python-novice- gapminder/issues/22#issuecomment-182573516)'s comment about online search: "If you find anything, other folks were confused enough to bother with a blog or Stack Overflow post, so it's probably not trivial."
it: Non dite ai partecipanti di cercare risposte su Google. : Uno degli obiettivi di questa lezione è quello di aiutare i principianti a costruirsi un modello mentale di come funziona la programmazione. Finché non possiedono questo modello, non sapranno che cosa cercare, o come riconoscere una risposta utile. Dir loro di cercare su Google può inoltre dare l'impressione che il problema che stanno cercando di risolvere sia banale. (Detto questo, se i partecipanti hanno sufficiente esperienza nella programmazione da essersi lasciati alle spalle questo tipo di problemi, chiedere loro di cercare soluzioni può aiutarli a consolidare la loro comprensione.) Vale anche la pena di citare un commento di [Trevor King](https://github.com/swcarpentry/python-novice- gapminder/issues/22#issuecomment-182573516)'s sulla ricerca online: "Se trovi qualcosa sul web, vuol dire che qualcun altro era confuso a sufficienza da disturbarsi a scrivere un post su un blog o su StackOverflow, e quindi è probabile che non sia un problema banale."

source: This lesson is an introduction to programming in Python for people with little or no previous programming experience. It uses plotting as its motivating example, and is designed to be used in both [Data Carpentry][dc-lessons] and [Software Carpentry][swc-lessons] workshops. This lesson references [JupyterLab][jupyterlab], but can be taught using a regular Python interpreter as well. Please note that this lesson uses Python 3 rather than Python 2.
it: Questa lezione è un'introduzione alla programmazione in Python destinata a chi ha poca o nessuna esperienza di programmazione. Usa la produzione di grafici come motivazione ed è progettata per essere usata sia in laboratori di [Data Carpentry][dc-lessons] sia di [Software Carpentry][swc-lessons]. Questa lezione fa riferimento all'ambiente [JupyterLab][jupyterlab], ma può essere usata anche con un normale interprete Python. Notare che questa lezione usa Python 3 e non Python 2.

source: > ## Under Design
it: > ## In via di progettazione

source: > > **This lesson is currently in its early design stage; > please check [the design notes]({{ page.root }}/design/) > to see what we have so far. > Contributions are very welcome: > we would be particularly grateful for exercises > and for commentary on the ones already there.**
it: > > **Questa lezione è ancora nelle fasi iniziali della sua progettazione; > fate riferimento alle [note di progettazione]({{ page.root }}/design/) > per sapere a che punto siamo. > I vostri contributi sono i benvenuti: > saremmo particolarmente grati per l'aggiunta di esercizi > e per i vostri commenti su quelli già presenti.**

source: > ## Prerequisites
it: > ## Prerequisiti
