Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: > > 1. Learners need to understand what files and directories are, > what a working directory is, > and how to start a Python interpreter. > > 2. Learners must install Python before the class starts. > > 3. Learners must get the gapminder data before class starts: > please download and unzip the file > [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). > > Please see [the setup instructions][lesson-setup] > for details.
it: > > 1. I partecipanti devono sapere cosa sono i file e le cartelle, > che cos'è la cartella di lavoro corrente, > e come lanciare l'interprete di Python. > > 2. I partecipanti devono installare Python prima che inizi la lezione. > > 3. I partecipanti devono scaricare i dati Gapminder prima dell'inizio della lezione: > vi preghiamo di scaricare e decomprimere il file > [python-novice-gapminder-data.zip]({{page.root}}/files/python-novice-gapminder-data.zip). > > Vedi [le istruzioni preparatorie][lesson-setup] > per maggiori dettagli.
