Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: --- layout: page title: "Contributor Code of Conduct" ---
it: --- layout: page title: "Codice di Condotta dei Partecipanti al Progetto" ---

source: As contributors and maintainers of this project, we pledge to follow the [Carpentry Code of Conduct][coc].
it: In qualità di partecipanti e organizzatori di questo progetto, promettiamo di seguire il [Codice di Condotta Carpentries][coc].

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by following our [reporting guidelines][coc-reporting].
it: Casi di comportamento offensivo, molesto, o altrimenti inaccettabile possono essere segnalati seguendo le [linee guida][coc-reporting].

source: ## Instructional Material
it: ## Materiale didattico

source: You are free:
it: Tu sei libero di:

source: * to **Share**---copy and redistribute the material in any medium or format
it: * **Condividere**---riprodurre, distribuire, comunicare al pubblico, esporre in pubblico, rappresentare, eseguire e recitare questo materiale con qualsiasi mezzo e formato

source: * to **Adapt**---remix, transform, and build upon the material
it: * **Modificare** --- remixare, trasformare il materiale e basarti su di esso per le tue opere

source: for any purpose, even commercially.
it: per qualsiasi fine, anche commerciale.

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
it: Il licenziante non può revocare questi diritti fintanto che tu rispetti i termini della licenza.

source: Under the following terms:
it: Alle seguenti condizioni:

source: * **Attribution**---You must give appropriate credit (mentioning that
it: * **Attribuzione**---Devi riconoscere una menzione di paternità adeguata (menzionando che

source: your work is derived from work that is Copyright © Software Carpentry and, where practical, linking to http://software-carpentry.org/), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
it: il tuo lavoro deriva da lavoro protetto da Copyright © Software Carpentry e, dove possibile, linkare a http://software-carpentry.org/), fornire un [link alla licenza][cc-by-human] e indicare se sono state effettuate delle modifiche. Puoi fare ciò in qualsiasi maniera ragionevole possibile, ma non con modalità tali da suggerire che il licenziante avalli te o il tuo utilizzo del materiale.

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
it: **Divieto di restrizioni aggiuntive**---Non puoi applicare termini legali o misure tecnologiche che impongano ad altri soggetti dei vincoli giuridici su quanto la licenza consente loro di fare.

source: Notices:
it: Note:

source: * You do not have to comply with the license for elements of the
it: * Non sei tenuto a rispettare i termini della licenza per quelle componenti del

source: material in the public domain or where your use is permitted by an applicable exception or limitation. * No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
it: materiale che siano in pubblico dominio o nei casi in cui il tuo utilizzo sia consentito da una eccezione o limitazione prevista dalla legge. * Non sono fornite garanzie. La licenza può non conferirti tutte le autorizzazioni necessarie per l'utilizzo che ti prefiggi. Ad esempio, diritti di terzi come i diritti all'immagine,alla riservatezza e i diritti morali potrebbero restringere gli usi che ti prefiggi sul materiale.

source: ## Trademark
it: ## Marchi

source: "Software Carpentry" and "Data Carpentry" and their respective logos are registered trademarks of [Community Initiatives][CI].
it: "Software Carpentry" e "Data Carpentry" e i rispettivi loghi sono marchi registrati di [Community Initiatives][CI].

source: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/ [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org
it: [cc-by-human]: https://creativecommons.org/licenses/by/4.0/deed.it [cc-by-legal]: https://creativecommons.org/licenses/by/4.0/legalcode.it [mit-license]: https://opensource.org/licenses/mit-license.html [ci]: http://communityin.org/ [osi]: https://opensource.org

source: --- title: "Running and Quitting" teaching: 15 exercises: 0 questions: - "How can I run Python programs?" objectives: - "Launch the JupyterLab server." - "Create a new Python script." - "Create a Jupyter notebook." - "Shutdown the JupyterLab server." - "Understand the difference between a Python script and a Jupyter notebook." - "Create Markdown cells in a notebook." - "Create and run Python cells in a notebook." keypoints: - "Python scripts are plain text files." - "Use the Jupyter Notebook for editing and running Python." - "The Notebook has Command and Edit modes." - "Use the keyboard and mouse to select and edit cells." - "The Notebook will turn Markdown into pretty-printed documentation." - "Markdown does most of what HTML does." ---
it: --- title: "Lanciare e chiudere Python" teaching: 15 exercises: 0 questions: - "Come lanciare un programma in Python?" objectives: - "Lanciare il server JupyterLab." - "Creare un nuovo script Python." - "Creare un Jupyter notebook." - "Spegnere il server JupyterLab." - "Capire la differenza tra un programma Python e un Jupyter notebook." - "Creare celle Markdown in un Jupyter notebook." - "Creare ed eseguire celle Python in un notebook." keypoints: - "Gli script in Python sono file di testo semplice." - "Usare il Jupyter Notebook per scrivere ed eseguire codice Python." - "Il Notebook ha le modalità Comando e Modifica." - "Usare la tastiera e il mouse per selezionare e modificare celle." - "Il Notebook può convertire codice Markdown in una documentazione curata." - "Il Markdown è in grado di fare la maggior parte di ciò che si può fare con l'HTML." ---

source: ## Getting Started with JupyterLab
it: ## Iniziare a usare JupyterLab

source: While many software developers will often use an integrated development environment (IDE) or a text editor to create and edit their Python programs we will be using [JupyterLab][jupyterlab] during this lesson.
it: Molti sviluppatori di software usano un ambiente di sviluppo integrato (IDE, integrated development environment) oppure un editor di testo per creare e modificare i loro programmi in Python. In questa lezione, noi useremo [JupyterLab][jupyterlab].

source: JupyterLab is an application with a web-based user interface from [Project Jupyter][jupyter] that enables one to work with documents and activities such as Jupyter notebooks, text editors, terminals, and even custom components in a flexible, integrated, and extensible manner. JupyterLab requires a reasonably up-to-date browser (ideally a current version of Chrome, Safari, or Firefox); Internet Explorer versions 9 and below are *not* supported.
it: JupyterLab è un'applicazione con un'interfaccia utente basata sul browser web, creata dal [Project Jupyter][jupyter], che ci permette di lavorare con documenti e strumenti come Jupyter notebook, editor di testo, terminali, e anche componenti personalizzate, in modo flessibile, integrato, ed espandibile. JupyterLab richiede un browser relativamente aggiornato (se possibile, una versione recente di Chrome, Safari o Firefox); Internet Explorer 9 e precedenti *non* sono supportati.

source: JupyterLab is included as part of the Anaconda Python distribution. If you have not already installed the Anaconda Python distribution, see [the setup instructions]({{ page.root }}/setup/) for installation instructions.
it: JupyterLab è già incluso nella distribuzione di Python chiamata Anaconda. Se non hai già installato la distribuzione Anaconda Python, leggi le [istruzioni di setup] ({{ page.root }}/setup/) per sapere come installarla.

source: Even though JupyterLab is a web-based application, JupyterLab runs locally on your machine and does not require an internet connection. * The JupyterLab server sends messages to your web browser. * The JupyterLab server does the work and the web browser renders the result. * You will type code into the browser and see the result when the web page talks to the JupyterLab server.
it: Sebbene JupyterLab sia un'applicazione a cui si accede dal browser web, JupyterLab è un software che gira localmente, sul tuo calcolatore, e non richiede una connessione a internet. * Il server JupyterLab invia comunicazioni al tuo browser web. * Il server JupyterLab esegue il lavoro, e il browser visualizza il risultato. * Quando scriverai codice nel browser, vedrai il risultato non appena la pagina web comunica con il server JupyterLab.

source: > ## JupyterLab? What about Jupyter notebooks?
it: > ## JupyterLab? E allora i Jupyter notebook cosa sono?

source: > JupyterLab is the [next stage in the evolution of the Jupyter Notebook](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html#overview). If you have prior
it: > JupyterLab è [lo stadio evolutivo successivo al Jupyter Notebook](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html#overview). Se hai già avuto

source: > experience working with Jupyter notebooks, then you will have a a good idea of what to expect
it: > occasione di lavorare con il Jupyter notebook, allora hai già un'idea di cosa aspettarti

source: > from JupyterLab.
it: > da JupyterLab.

source: > Experienced users of Jupyter notebooks interested in a more detailed discussion of the similarities and differences
it: > Chi ha già una buona conoscenza del Jupyter notebook ed è interessato in una discussione più approfondita sulle somiglianze e differenze

source: > between the JupyterLab and Jupyter notebook user interfaces can find more information in the
it: > tra le interfacce utente di JupyterLab e del Jupyter notebook, può trovare maggiori informazioni nella

source: > [JupyterLab user interface documentation][jupyterlab-ui].
it: > [documentazione dell'interfaccia utente JupyterLab][jupyterlab-ui].

source: ## Starting JupyterLab
it: ## Lanciare JupyterLab

source: To start the JupyterLab server you will need to access the command line through the Terminal. There are two ways to open Terminal on Mac.
it: Per far partire il server JupyterLab, è necessario avere accesso alla linea di comando, attraverso il Terminale. Ci sono due modi per aprire il Terminale sul Mac.

source: 1. In your Applications folder, open Utilities and double-click on Terminal
it: 1. Nella cartella Applicazioni, apri Utilities/Utilità, e fai doppio clic su Terminale.

source: 2. Press <kbd>Command</kbd> + <kbd>spacebar</kbd> to launch Spotlight. Type `Terminal` and then
it: 2. Press <kbd>Comando</kbd> + <kbd>barra spaziatrice</kbd> per aprire Spotlight. Digita `Terminale` e

source: double-click the search result or hit <kbd>Enter</kbd>
it: e fai doppio clic sul risultato della ricerca, o premi <kbd>Invio</kbd>

source: After you have launched Terminal, type the command to launch the JupyterLab server.
it: Una volta aperto il terminale, scrivi il comando che fa partire il server JupyterLab.

source: ### Windows Users
it: ### Per utenti Windows

source: To start the JupyterLab server you will need to access the open Anaconda Prompt.
it: Per far partire il server JupyterLab, è necessario aprire Anaconda Prompt.

source: Press <kbd>Windows Logo Key</kbd> and search for `Anaconda Prompt`, click the result or press enter.
it: Premi <kbd>Tasto Windows</kbd> e cerca `Anaconda Prompt`, clicca sul risultato o premi Invio.

source: After you have launched the Anaconda Prompt, type the command:
it: Dopo aver aperto Anaconda Prompt, scrivi il comando:

source: Below is a screenshot of a similar JupyterLab landing page to the one that should open in your default web browser after starting the JupyterLab server on wither Mac OS X or Windows.
it: Qui sotto, uno screenshot della pagina iniziale di JupyterLab, simile a quella che dovrebbe aprirsi sul tuo browser predefinito dopo aver lanciato il server JupyterLab, sia su Mac OS X sia su Windows.

source: ## The JupyterLab Interface
it: ## L'interfaccia JupyterLab

source: JupyterLab has many features found in traditional integrated development environments (IDEs) but is focused on providing flexible building blocks for interactive, exploratory computing.
it: JupyterLab ha molte caratteristiche simili a quelle degli ambienti di sviluppo integrato (IDE) più tradizionali, ma è specializzato nel costruire moduli adattabili, per programmi interattivi ed esplorativi.

source: The [JupyterLab Interface](https://jupyterlab.readthedocs.io/en/stable/user/interface.html) consists of the Menu Bar, a collapsable Left Side Bar, and the Main Work Area which contains tabs of documents and activities.
it: L'[interfaccia JupyterLab](https://jupyterlab.readthedocs.io/en/stable/user/interface.html) consiste in una barra del menù, una barra laterale sinistra (che può essere nascosta), e nell'area di lavoro principale, che contiene diverse schede con documenti e attività.

source: ### Menu Bar
it: ### Barra del menù

source: The Menu Bar at the top of JupyterLab has the top-level menus that expose various actions available in JupyterLab along with their keyboard shortcuts (where applicable). The following menus are included by default.
it: La barra del menù nella parte alta di JupyterLab ha menù principali che mostrano le varie azioni disponibili in JupyterLab, insieme alle loro scorciatoie da tastiera (laddove esistono). I menù seguenti sono predefiniti.

source: * **File:** Actions related to files and directories such as *New*, *Open*, *Close*, *Save*, etc. The *File* menu also includes the *Quit* action used to shutdown the JupyterLab server.
it: * **File:** Azioni relative ai file e alle cartelle, come *New* (nuovo), *Open* (apri), *Close* (chiudi), *Save* (salva), ecc. Il menù *File* contiene anche l'azione *Quit* (esci), usata per spegnere il server JupyterLab.

source: * **Edit:** Actions related to editing documents and other activities such as *Undo*, *Cut*, *Copy*, *Paste*, etc.
it: * **Edit:** Azioni relative alla modifica dei documenti, e altre simili, come *Undo* (annulla), *Cut* (taglia), *Copy* (copia), *Paste* (incolla), ecc.

source: * **View:** Actions that alter the appearance of JupyterLab.
it: * **View** (vista): azioni che modificano l'aspetto di JupyterLab.

source: * **Run:** Actions for running code in different activities such as notebooks and code consoles (discussed below).
it: * **Run:** Azioni per eseguire il codice nelle diverse "attività", come i notebook e le console (spiegate più sotto).

source: * **Kernel:** Actions for managing kernels which, as mentioned above, are separate processes for running code.
it: * **Kernel:** Azioni per la gestione dei kernel, che, come detto sopra, sono processi tra loro separati che eseguono il codice.

source: * **Tabs:** A list of the open documents and activities in the dock panel.
it: * **Tabs:** La lista dei documenti e delle attività aperte nel pannello dock.

source: * **Settings:** Common JupyterLab settings can be configured using this menu. There is also an *Advanced Settings Editor* option in the dropdown menu that provides more fine-grained control of JupyterLab settings and configuration options.
it: * **Settings:** le impostazioni più comuni di JupyterLab possono essere configurate usando questo menù. C'è anche un'opzione "Advanced Settings Editor" nel menù a tendina, che serve per un controllo più preciso delle impostazioni e configurazioni di JupyterLab.

source: * **Help:** A list of JupyterLab and kernel help links.
it: * **Help:** Una lista di link di aiuto su JupyterLab e sui kernel.

source: A screenshot of the default Menu Bar is provided below.
it: Qui sotto, uno screenshot della barra dei menù predefinita.

source: ### Left Sidebar
it: ### Barra laterale sinistra

source: The left sidebar contains a number of commonly-used tabs, such as a file browser (showing the contents of the directory in which the JupyterLab server was launched!), a list of running kernels and terminals, the command palette, and a list of open tabs in the main work area. A screenshot of the default Left Side Bar is provided below.
it: La barra laterale sinistra contiene diverse schede usate di frequente, come il navigfatore dei file (che mostra i contenuti della cartella in cui il server JupyterLab è stato lanciato), una lista dei kernel e dei terminali attualmente attivi, la palette dei comandi, e una lista delle schede aperte nell'area di lavoro principale. Qui sotto è mostrato uno screenshot della barra laterale sinistra predefinita.

source: The left sidebar can be collapsed or expanded by selecting “Show Left Sidebar” in the View menu or by clicking on the active sidebar tab.
it: La barra laterale sinistra può essere nascosta o mostrata selezionando "Show Left Sidebar" nel menù View o cliccando sull'icona della scheda attiva al momento.

source: ### Main Work Area
it: ### Area di lavoro principale

source: The main work area in JupyterLab enables you to arrange documents (notebooks, text files, etc.) and other activities (terminals, code consoles, etc.) into panels of tabs that can be resized or subdivided. A screenshot of the default Menu Bar is provided below.
it: L'area di lavoro principale di JupyterLab consente di gestire i documenti (notebook, file di testo, ecc.) e le altre attività (i terminali, le console del codice, ecc.), sistemandoli in pannelli di schede che possono essere ridimensionati o suddivisi. Qui sotto è mostrato uno screenshot della barra del menù predefinita.

source: Drag a tab to the center of a tab panel to move the tab to the panel. Subdivide a tab panel by dragging a tab to the left, right, top, or bottom of the panel. The work area has a single current activity. The tab for the current activity is marked with a colored top border (blue by default).
it: Per spostare una scheda in un pannello, trascina la scheda verso il centro di un pannello di schede. Per suddividere un pannello di schede, trascina una scheda alla sinistra, alla destra, o sopra o sotto al pannello. L'area di lavoro ha sempre una sola attività corrente. La scheda corrispondente a questa attività è identificato da un bordo superiore colorato (blu è il colore predefinito).

source: ## Creating a Python script
it: ## Creare uno script in Python

source: * To start writing a new Python program click the Text File icon under the *Other* header in the Launcher tab of the Main Work Area.
it: * Per iniziare a scrivere un nuovo programma in Python, clicca sull'icona Text File (file di testo) sotto l'intestazione *Other* (altro), nella scheda Launcher dell'area di lavoro principale.

source: * You can also create a new plain text file by selecting the *New -> Text File* from the *File* menu in the Menu Bar.
it: * In alternativa, si può anche creare un nuovo file di testo selezionando *New -> Text File* dal menù *File* nella barra dei menù.

source: * To convert this plain text file to a Python program, select the *Save File As* action from the *File* menu in the Menu Bar and give your new text file a name that ends with the `.py` extension.
it: * Per convertire questo file di testo semplice in un programma Python, seleziona l'azione *Save File As* (salva come) dal menù *File* nella barra dei menù, e dai al tuo nuovo file di testo un nome che termina con l'estensione `.py`.

source: * The `.py` extension lets everyone (including the operating system) know that this text file is a Python program.
it: * L'estensione `.py` rende noto a tutti (incluso il sistema operativo) che questo file di testo è un programma in Python.

source: * This is convention, not a requirement.
it: * Questa non è una condizione necessaria, ma una convenzione.

source: ## Creating a Jupyter Notebook
it: ## Creare un Jupyter Notebook

source: To open a new notebook click the Python 3 icon under the *Notebook* header in the Launcher tab in the main work area. You can also create a new notebook by selecting *New -> Notebook* from the *File* menu in the Menu Bar.
it: Per aprire un nuovo notebook, clicca sull'icona Python 3 sotto l'intestazione *Notebook* della scheda Launcher nell'area di lavoro principale. Si può creare un notebook anche selezionando *New -> Notebook* dal menù *File* nella barra dei menù.

source: Additional notes on Jupyter notebooks.
it: Altre informazioni sui Jupyter notebook.

source: * Notebook files have the extension `.ipynb` to distinguish them from plain-text Python programs.
it: * I notebook sono file con l'estensione `.ipynb`, in modo che si possano distinguere dai programmi Python in formato testo semplice.

source: * Notebooks can be exported as Python scripts that can be run from the command line.
it: * I notebook possono essere esportati in script Python che possono poi essere eseguiti da linea di comando.

source: Below is a screenshot of a Jupyter notebook running inside JupyterLab. If you are interested in more details, then see the [official notebook documentation][jupyterlab-notebook-docs].
it: Qui sotto, è mostrato uno screenshot di un Jupyter notebook attivo all'interno di JupyterLab. Se ti interessano altri dettagli, vedi la [documentazione ufficiale dei notebook][jupyterlab-notebook-docs].

source: > ## How It's Stored
it: > ## Come funziona il formato notebook

source: > > * The notebook file is stored in a format called JSON. > * Just like a webpage, what's saved looks different from what you see in your browser. > * But this format allows Jupyter to mix source code, text, and images, all in one file.
it: > > * I file notebook sono salvati in un formato chiamato JSON. > * Proprio come per una pagina web, ciò che è salvato ha un aspetto diverso da ciò che è mostrato nel browser. > * Tuttavia, questo formato permette a Jupyter di mescolare codice sorgente, testo e immagini in uno stesso file.

source: > ## Arranging Documents into Panels of Tabs
it: > ## Disporre documenti in pannelli di schede
