Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: * We have seen some functions already --- now let's take a closer look.
it: * Abbiamo già visto alcuni esempi di funzioni. Ora, diamo un'occhiata più da vicino.

source: * An *argument* is a value passed into a function.
it: * Una *argomento* è un valore passato a una funzione.

source: * `len` takes exactly one.
it: * `len` ne richiede esattamente uno.

source: * `int`, `str`, and `float` create a new value from an existing one.
it: * `int`, `str`, e `float` creano un nuovo valore a partire da uno esistente.

source: * `print` takes zero or more.
it: * `print` ne richiede zero o più.

source: * `print` with no arguments prints a blank line.
it: * `print` senza argomenti stampa una riga di testo vuota.

source: * Must always use parentheses, even if they're empty,
it: * Le parentesi vanno sempre usate, anche quando sono vuote,

source: so that Python knows a function is being called.
it: così che Python sappia che stiamo chiamando una funzione.

source: ~~~ print('before') print() print('after') ~~~
it: ~~~ print('prima') print() print('dopo') ~~~

source: {: .language-python} ~~~ before
it: {: .language-python} ~~~ prima

source: after ~~~
it: dopo ~~~

source: ## Commonly-used built-in functions include `max`, `min`, and `round`.
it: ## Tra le funzioni predefinite più comuni ci sono `max`, `min` e `round`.

source: * Use `max` to find the largest value of one or more values.
it: * Si usa `max` per trovare il massimo tra uno o più valori.

source: * Use `min` to find the smallest.
it: * Si usa `min` per trovare il minimo.

source: * Both work on character strings as well as numbers.
it: * Entrambi funzionano sia sui numeri che sulle stringhe di caratteri.

source: * "Larger" and "smaller" use (0-9, A-Z, a-z) to compare letters.
it: * Il concetto di "maggiore" e "minore" usa l'ordinamento (0-9, A-Z, a-z) per i caratteri.

source: ## Functions may only work for certain (combinations of) arguments.
it: ## Le funzioni possono funzionare solo con certe combinazioni di argomenti.

source: * `max` and `min` must be given at least one argument.
it: * `max` e `min` richiedono almeno un argomento.

source: * "Largest of the empty set" is a meaningless question.
it: * "Qual è valore massimo di un insieme vuoto" è una domanda priva di senso.

source: * And they must be given things that can meaningfully be compared.
it: * Inoltre, devono ricevere input che possono essere confrontati tra loro in modo sensato.

source: ## Functions may have default values for some arguments.
it: ## Le funzioni possono avere valori predefiniti per alcuni argomenti.

source: * `round` will round off a floating-point number.
it: * `round` arrotonda i numeri a virgola mobile.

source: * By default, rounds to zero decimal places.
it: * Di default, arrotonda a zero cifre decimali.

source: * We can specify the number of decimal places we want.
it: * Si può specificare il numero di cifre decimali desiderato.

source: ## Use the built-in function `help` to get help for a function.
it: ## Usare la funzione predefinita `help` per ottenere aiuto relativamente a una funzione.

source: * Every built-in function has online documentation.
it: * Tutte le funzioni predefinite hanno una documentazione in linea.

source: ## Python reports a syntax error when it can't understand the source of a program.
it: ## Python mostra un errore di sintassi quando non riesce a capire il codice sorgente di un programma.

source: * Won't even try to run the program if it can't be parsed.
it: * Non prova nemmeno a eseguire il programma, se la sua sintassi non può essere analizzata.

source: ~~~ # Forgot to close the quote marks around the string. name = 'Feng ~~~
it: ~~~ # Qui abbiamo dimenticato di chiudere le virgolette attorno alla stringa. nome = 'Feng ~~~

source: {: .language-python} ~~~ File "<ipython-input-56-f42768451d55>", line 2 name = 'Feng ^ SyntaxError: EOL while scanning string literal ~~~
it: {: .language-python} ~~~ File "<ipython-input-56-f42768451d55>", line 2 nome = 'Feng ^ SyntaxError: EOL while scanning string literal ~~~

source: ~~~ # An extra '=' in the assignment. age = = 52 ~~~
it: ~~~ # Un '=' di troppo nella definizione. anni = = 52 ~~~

source: {: .language-python} ~~~ File "<ipython-input-57-ccc3df3cf902>", line 2 age = = 52 ^ SyntaxError: invalid syntax ~~~
it: {: .language-python} ~~~ File "<ipython-input-57-ccc3df3cf902>", line 2 anni = = 52 ^ SyntaxError: invalid syntax ~~~

source: * Look more closely at the error message:
it: * Osserva il messaggio di errore con attenzione:

source: * The message indicates a problem on first line of the input ("line 1").
it: * Il messaggio segnala un problema alla prima riga dell'input ("line 1").

source: * In this case the "ipython-input" section of the file name tells us that
it: * In questo caso, il nome del file "ipython-input" indica che

source: we are working with input into IPython, the Python interpreter used by the Jupyter Notebook. * The `-6-` part of the filename indicates that the error occurred in cell 6 of our Notebook. * Next is the problematic line of code, indicating the problem with a `^` pointer.
it: stiamo lavorando con un input dato a IPython, l'interprete Python usato dal Jupyter Notebook. * La parte `-6-` del nome del file indica che l'errore si è verificato nella cella 6 del nostro Notebook. * Dopo, è indicata la riga di codice problematica, con il problema indicato da un puntatore `^`.

source: ## <a name='runtime-error'></a> Python reports a runtime error when something goes wrong while a program is executing.
it: ## <a name='runtime-error'></a> Python mostra un errore runtime quando qualcosa non funziona mentre il programma viene eseguito.

source: ~~~ age = 53 remaining = 100 - aege # mis-spelled 'age' ~~~
it: ~~~ anni = 53 rimanenti = 100 - annni # 'anni' è scritto sbagliato ~~~

source: {: .language-python} ~~~ NameError Traceback (most recent call last) <ipython-input-59-1214fb6c55fc> in <module> 1 age = 53 ----> 2 remaining = 100 - aege # mis-spelled 'age'
it: {: .language-python} ~~~ NameError Traceback (most recent call last) <ipython-input-59-1214fb6c55fc> in <module> 1 anni = 53 ----> 2 rimanenti = 100 - annni # 'anni' è scritto sbagliato

source: NameError: name 'aege' is not defined ~~~
it: NameError: name 'annni' is not defined ~~~

source: * Fix syntax errors by reading the source and runtime errors by tracing execution.
it: * Gli errori di sintassi si risolvono rileggendo il codice sorgente, gli errori runtime tracciando l'esecuzione del programma.

source: ## The Jupyter Notebook has two ways to get help.
it: ## Il Jupyter Notebook ha due modi per ottenere aiuto.

source: * Place the cursor anywhere in the function invocation
it: * Muovi il cursore ovunque in una chiamata a una funzione

source: (i.e., the function name or its parameters), hold down `shift`, and press `tab`. * Or type a function name with a question mark after it.
it: (cioè, nel nome della funzione o tra i suoi parametri), tieni premuto `shift`, e premi `tab`. * Oppure scrivi il nome di una funzione seguito da un punto di domanda.

source: ## Every function returns something.
it: ## Tutte le funzioni restituiscono qualcosa.

source: * Every function call produces some result.
it: * Ogni chiamata a funzione produce un risultato.

source: * If the function doesn't have a useful result to return,
it: * Se la funzione non ha un risultato utile da restituire,

source: it usually returns the special value `None`.
it: normalmente restituisce il valore speciale `None` ("Nulla").

source: ~~~ result = print('example') print('result of print is', result) ~~~
it: ~~~ risultato = print('esempio') print('il risultato di print è', risultato) ~~~

source: {: .language-python} ~~~ example result of print is None ~~~
it: {: .language-python} ~~~ esempio il risultato di print è None ~~~

source: > ## What Happens When
it: > ## L'ordine di esecuzione

source: > > 1. Explain in simple terms the order of operations in the following program: > when does the addition happen, when does the subtraction happen, > when is each function called, etc. > 2. What is the final value of `radiance`? > > ~~~ > radiance = 1.0 > radiance = max(2.1, 2.0 + min(radiance, 1.1 * radiance - 0.5)) > ~~~ > {: .language-python} > > ## Solution > > 1. > > 1. `1.1 * radiance = 1.1` > > 2. `1.1 - 0.5 = 0.6` > > 3. `min(radiance, 0.6) = 0.6` > > 4. `2.0 + 0.6 = 2.6` > > 5. `max(2.1, 2.6) = 2.6` > > 2. At the end, `radiance = 2.6`
it: > > 1. Spiega in modo semplice l'ordine delle operazioni nel seguente programma: > quando si verifica l'addizione, quando la sottrazione, > quando avviene la chiamata ad ognuna delle funzioni, ecc. > 2. Qual è il valore finale di `radianza`? > > ~~~ > radianza = 1.0 > radianza = max(2.1, 2.0 + min(radianza, 1.1 * radianza - 0.5)) > ~~~ > {: .language-python} > > ## Soluzione > > 1. > > 1. `1.1 * radianza = 1.1` > > 2. `1.1 - 0.5 = 0.6` > > 3. `min(radianza, 0.6) = 0.6` > > 4. `2.0 + 0.6 = 2.6` > > 5. `max(2.1, 2.6) = 2.6` > > 2. Alla fine, `radianza = 2.6`

source: > ## Spot the Difference
it: > ## Trova le differenze

source: > > 1. Predict what each of the `print` statements in the program below will print. > 2. Does `max(len(rich), poor)` run or produce an error message? > If it runs, does its result make any sense? > > ~~~ > easy_string = "abc" > print(max(easy_string)) > rich = "gold" > poor = "tin" > print(max(rich, poor)) > print(max(len(rich), len(poor))) > ~~~ > {: .language-python} > > ## Solution > > ~~~ > > print(max(easy_string)) > > ~~~ > > {: .language-python} > > ~~~ > > c > > ~~~ > > {: .output} > > ~~~ > > print(max(rich, poor)) > > ~~~ > > {: .language-python} > > ~~~ > > tin > > ~~~ > > {: .output} > > ~~~ > > print(max(len(rich), len(poor))) > > ~~~ > > {: .language-python} > > ~~~ > > 4 > > ~~~ > > {: .output} > > `max(len(rich), poor)` throws a TypeError. This turns into `max(4, 'tin')` and > > as we discussed earlier a string and integer cannot meaningfully be compared. > > ~~~ > > TypeError Traceback (most recent call last) > > <ipython-input-65-bc82ad05177a> in <module> > > ----> 1 max(len(rich), poor) > > > > TypeError: '>' not supported between instances of 'str' and 'int' > > ~~~ > > {: .error }
it: > > 1. Cerca di prevedere che cosa sarà stampato da ognuna delle chiamate a `print` seguenti. > 2. `max(len(rich), poor)` funziona o produce un messaggio di errore? > Se funziona, pensi che il risultato abbia senso? > > ~~~ > stringa_facile = "abc" > print(max(stringa_facile)) > ricco = "argento" > povero = "stagno" > print(max(ricco, povero)) > print(max(len(ricco), len(povero))) > ~~~ > {: .language-python} > > ## Soluzione > > ~~~ > > print(max(stringa_facile)) > > ~~~ > > {: .language-python} > > ~~~ > > c > > ~~~ > > {: .output} > > ~~~ > > print(max(ricco, povero)) > > ~~~ > > {: .language-python} > > ~~~ > > stagno > > ~~~ > > {: .output} > > ~~~ > > print(max(len(ricco), len(povero))) > > ~~~ > > {: .language-python} > > ~~~ > > 7 > > ~~~ > > {: .output} > > `max(len(ricco), povero)` restituisce un TypeError (errore di tipo). L'operazione si traduce in `max(7, 'stagno')` e > > come abbiamo detto in precedenza, non c'è un modo sensato di confrontare una stringa e un intero. > > ~~~ > > TypeError Traceback (most recent call last) > > <ipython-input-65-bc82ad05177a> in <module> > > ----> 1 max(len(ricco), povero) > > > > TypeError: '>' not supported between instances of 'str' and 'int' > > ~~~ > > {: .error }

source: > ## Why Not?
it: > ## Perché no?

source: > > Why don't `max` and `min` return `None` when they are given no arguments? > > > ## Solution > > `max` and `min` return TypeErrors in this case because the correct number of parameters > > was not supplied. If it just returned `None`, the error would be much harder to trace as it > > would likely be stored into a variable and used later in the program, only to likely throw > > a runtime error.
it: > > Perché `max` e `min` non ritornano `None` quando non ricevono argomenti? > > > ## Soluzione > > `max` e `min` restituiscono dei TypeError in questo caso, perché non gli abbiamo dato il numero > > giusto di parametri. Se restituisse `None`, l'errore sarebbe molto più difficile da trovare, perché > > verrebbe probabilmente registrato in una variabile e usato più avanti nel programma, > > probabilmente causando un runtime error.

source: > ## Last Character of a String
it: > ## L'ultimo carattere in una stringa

source: > > If Python starts counting from zero, > and `len` returns the number of characters in a string, > what index expression will get the last character in the string `name`? > (Note: we will see a simpler way to do this in a later episode.) > > > ## Solution > > > > `name[len(name) - 1]`
it: > > Se Python inizia a contare da zero, > e `len` restituisce il numero di caratteri in una stringa, > qual è l'espressione con gli indici che restituirà l'ultimo carattere della stringa `nome`? > (N.B.: studieremo un modo più semplice di fare lo stesso in una lezione successiva.) > > > ## Soluzione > > > > `nome[len(nome) - 1]`

source: --- layout: break title: "Morning Coffee" teaching: 0 exercises: 0 break: 15 ---
it: --- layout: break title: "Pausa di metà mattina" teaching: 0 exercises: 0 break: 15 ---

source: # Reflection exercise
it: # Esercizio su cui riflettere

source: Over coffee, reflect on and discuss the following: * What are the different kinds of errors Python will report? * Did the code always produce the results you expected? If not, why? * Is there something we can do to prevent errors when we write code?
it: Mentre bevi il caffè, rifletti e discuti i punti seguenti: * Quali sono i tipi di errore che Python può dare? * Hai sempre ottenuto i risultati che ti aspettavi dal codice? Se no, perché? * Quando scriviamo codice, cosa possiamo fare per prevenire gli errori?

source: --- title: "Libraries" teaching: 10 exercises: 10 questions: - "How can I use software that other people have written?" - "How can I find out what that software does?" objectives: - "Explain what software libraries are and why programmers create and use them." - "Write programs that import and use libraries from Python's standard library." - "Find and read documentation for standard libraries interactively (in the interpreter) and online." keypoints: - "Most of the power of a programming language is in its libraries." - "A program must import a library module in order to use it." - "Use `help` to learn about the contents of a library module." - "Import specific items from a library to shorten programs." - "Create an alias for a library when importing it to shorten programs." ---
it: --- title: "Librerie" teaching: 10 exercises: 10 questions: - "Come si fa a usare software scritto da altri?" - "Come si fa a sapere a cosa serve un certo software?" objectives: - "Spiegare cosa sono le librerie di software e perché i programmatori le creano e le usano." - "Scrivere programmi che importano e usano software della libreria standard di Python." - "Trovare e leggere la documentazione delle librerie standard in modo interattivo (nell'interprete) e online." keypoints: - "Gran parte della forza di un linguaggio di programmazione consiste nelle sue librerie." - "Un modulo di una libreria deve essere importato per essere usato." - "Si usa `help` per scoprire il contenuto di un modulo di una libreria." - "Per accorciare i programmi, si possono importare solo specifici elementi di una libreria." - "Per accorciare i programmi, si può dare un alias a una libreria quando la si importa." ---

source: ## Most of the power of a programming language is in its libraries.
it: ## Gran parte della forza di un linguaggio di programmazione consiste nelle sue librerie.

source: * A *library* is a collection of files (called *modules*) that contains
it: * Una *libreria* è una collezione di file (chiamati *moduli*) che contiene

source: functions for use by other programs. * May also contain data values (e.g., numerical constants) and other things. * Library's contents are supposed to be related, but there's no way to enforce that. * The Python [standard library][stdlib] is an extensive suite of modules that comes with Python itself. * Many additional libraries are available from [PyPI][pypi] (the Python Package Index). * We will see later how to write new libraries.
it: funzioni scritte per essere usate da altri programmi. * Può anche contenere dati (per esempio costanti numeriche) o altro. * I contenuti di una libreria dovrebbero essere relativi a uno stesso tema, ma non c'è modo di garantirlo. * La [libreria standard][stdlib] di Python è un'estesa collezione di moduli che è sempre inclusa in Python stesso. * Moltissime librerie aggiuntive sono disponibili su [PyPI][pypi] (l'indice dei pacchetti di Python). * Vedremo come scrivere nuove librerie più avanti.

source: > ## Libraries and modules
it: > ## Librerie e moduli

source: > > A library is a collection of modules, but the terms are often used > interchangeably, especially since many libraries only consist of a single > module, so don't worry if you mix them.
it: > > Una libreria è una collezione di moduli, ma i due termini sono spesso usati come sinonimi, > soprattutto perché molte librerie contengono un solo modulo; perciò, non preoccuparti se confondi le due cose.

source: ## A program must import a library module before using it.
it: ## Un modulo di una libreria deve essere importato per essere usato.

source: * Use `import` to load a library module into a program's memory.
it: * Si usa `import` per caricare un modulo di una libreria nella memoria di un programma.

source: * Then refer to things from the module as `module_name.thing_name`.
it: * Poi, ci si riferisce a un contenuto del modulo con `nome_modulo.nome_contenuto`.

source: * Python uses `.` to mean "part of".
it: * Python usa `.` per significare "parte di".

source: * Using `math`, one of the modules in the standard library:
it: * Usando `math`, uno dei moduli della libreria standard:

source: ~~~ import math print('pi is', math.pi) print('cos(pi) is', math.cos(math.pi)) ~~~
it: ~~~ import math print('pi greco è', math.pi) print('cos(pigreco) è', math.cos(math.pi)) ~~~

source: {: .language-python} ~~~ pi is 3.141592653589793 cos(pi) is -1.0 ~~~
it: {: .language-python} ~~~ pi greco è 3.141592653589793 cos(pigreco) è -1.0 ~~~

source: * Have to refer to each item with the module's name.
it: * È necessario chiamare tutti gli elementi contenuti con il nome del modulo.

source: * `math.cos(pi)` won't work: the reference to `pi`
it: * `math.cos(pi)` non funziona, perché il riferimento a `pi`

source: doesn't somehow "inherit" the function's reference to `math`.
it: non ha modo di "ereditare" il riferimento a `math` della funzione.

source: ## Use `help` to learn about the contents of a library module.
it: ## Si usa `help` per scoprire il contenuto di un modulo di una libreria.

source: * Works just like help for a function.
it: * Funziona esattamente come help per una funzione.

source: ## Import specific items from a library module to shorten programs.
it: ## Per accorciare i programmi, si possono importare solo specifici elementi di una libreria.

source: * Use `from ... import ...` to load only specific items from a library module.
it: * Si usa `from ... import ...` per caricare solo certi elementi specifici da un modulo di una libreria

source: * Then refer to them directly without library name as prefix.
it: * Poi, ci si può riferire direttamente a questi senza usare il nome della libreria come prefisso.

source: ~~~ from math import cos, pi print('cos(pi) is', cos(pi)) ~~~
it: ~~~ from math import cos, pi print('cos(pigreco) è', cos(pi)) ~~~

source: {: .language-python} ~~~ cos(pi) is -1.0 ~~~
it: {: .language-python} ~~~ cos(pigreco) è -1.0 ~~~

source: ## Create an alias for a library module when importing it to shorten programs.
it: ## Per accorciare i programmi, si può dare un alias a una libreria quando la si importa.

source: * Use `import ... as ...` to give a library a short *alias* while importing it.
it: * Si usa `import ... as ...` per dare a una libreria un "soprannome" (*alias*) quando la si importa.

source: * Then refer to items in the library using that shortened name.
it: * Poi, ci si riferisce ai membri della libreria usando il nome abbreviato.

source: ~~~ import math as m print('cos(pi) is', m.cos(m.pi)) ~~~
it: ~~~ import math as m print('cos(pigreco) è', m.cos(m.pi)) ~~~

source: * Commonly used for libraries that are frequently used or have long names.
it: * Questo si fa normalmente per librerie che sono usate di frequente o hanno nomi lunghi.

source: * E.g., `matplotlib` plotting library is often aliased as `mpl`.
it: * Ad esempio, la libreria per i grafici `matplotlib` è spesso abbreviata in `mpl`.

source: * But can make programs harder to understand,
it: * Tuttavia, questo può rendere i programmi più difficili da capire,

source: since readers must learn your program's aliases.
it: poiché il lettore deve ricordarsi gli alias usati nel programma.

source: > ## Exploring the Math Module
it: > ## Esplorare il modulo Math

source: > > 1. What function from the `math` module can you use to calculate a square root > *without* using `sqrt`? > 2. Since the library contains this function, why does `sqrt` exist? > > > ## Solution > > 1. Using `help(math)` we see that we've got `pow(x,y)` in addition to `sqrt(x)`, > > so we could use `pow(x, 0.5)` to find a square root. > > 2. The `sqrt(x)` function is arguably more readable than `pow(x, 0.5)` when > > implementing equations. Readability is a cornerstone of good programming, so it > > makes sense to provide a special function for this specific common case. > > > > Also, the design of Python's `math` library has its origin in the C standard, > > which includes both `sqrt(x)` and `pow(x,y)`, so a little bit of the history > > of programming is showing in Python's function names.
it: > > 1. Quale funzione del modulo `math` si potrebbe usare per calcolare una radice quadrata > *senza* usare `sqrt`? > 2. Se questa funzione è presente nella libreria, perché esiste anche `sqrt`? > > > ## Soluzione > > 1. Usando `help(math)` notiamo che c'è anche `pow(x,y)` oltre a `sqrt(x)`, > > pertanto possiamo usare `pow(x, 0.5)` per calcolare una radice quadrata. > > 2. Si può dire che la funzione `sqrt(x)` sia più leggibile di `pow(x, 0.5)` > > scrivendo un'equzione. La leggibilità è una pietra angolare della buona programmazione, > > per cui ha senso avere una funzione specialmente per questo caso specifico comune. > > > > Inoltre, la struttura della libreria `math` di Python ha le sue radici nello standard del C, > > che include sia `sqrt(x)` che `pow(x,y)`, pertanto un indizio della storia > > della programmazione emerge dai nomi delle funzioni di Python.

source: > ## Locating the Right Module
it: > ## Trovare il modulo giusto
