Repository: CarpentriesItalia/i18n
Catalog: po/python-novice-gapminder.*.po
Languages: it

source: * Here, Python assigns an age to a variable `age`
it: * Qui, Python assegna un'età alla variabile `anni`

source: and a name in quotes to a variable `first_name`.
it: e un nome, posto tra virgolette, a una variabile chiamata `nome`.

source: ~~~ age = 42 first_name = 'Ahmed' ~~~
it: ~~~ anni = 42 nome = 'Ahmed' ~~~

source: * Variable names
it: * I nomi delle variabili

source: * can **only** contain letters, digits, and underscore `_` (typically used to separate words in long variable names)
it: * possono **soltanto** contenere lettere, cifre, e il trattino basso `_` (generalmente usato per separare le parole in nomi lunghi)

source: * cannot start with a digit
it: * non possono iniziare con una cifra

source: * are **case sensitive** (age, Age and AGE are three different variables)
it: * distinguono tra **minuscole e maiuscole** (anni, Anni e ANNI sono tre variabili differenti)

source: * Variable names that start with underscores like `__alistairs_real_age` have a special meaning
it: * Le variabili con nomi che iniziano con un trattino basso, come `__vera_eta_di_alistair` hanno un significato speciale

source: so we won't do that until we understand the convention.
it: perciò, non li useremo finché non avremo spiegato questa convenzione.

source: ## Use `print` to display values.
it: ## Usare `print` per visualizzare valori

source: * Python has a built-in function called `print` that prints things as text.
it: * Python ha una funzione predefinita chiamata `print` (stampa) che visualizza i valori in forma di testo.

source: * Call the function (i.e., tell Python to run it) by using its name.
it: * Chiama la funzione (cioè, di' a Python di eseguirla) usandone il nome.

source: * Provide values to the function (i.e., the things to print) in parentheses.
it: * Passa valori alla funzione (cioè gli oggetti da stampare) mettendoli tra parentesi.

source: * To add a string to the printout, wrap the string in single or double quotes.
it: * Per aggiungere una stringa ai valori stampati, mettila tra virgolette singole o doppie.

source: * The values passed to the function are called **arguments**
it: * I valori passati alla funzione si chiamano **argomenti**

source: ~~~ print(first_name, 'is', age, 'years old') ~~~
it: ~~~ print(nome, 'ha', anni, 'anni') ~~~

source: {: .language-python} ~~~ Ahmed is 42 years old ~~~
it: {: .language-python} ~~~ Ahmed ha 42 anni ~~~

source: * `print` automatically puts a single space between items to separate them.
it: * `print` inserisce automaticamente un singolo spazio tra i diversi oggetti, per separarli.

source: * And wraps around to a new line at the end.
it: * E va automaticamente a capo alla fine.

source: ## Variables must be created before they are used.
it: ## Le variabili devono essere definite prima di essere usate.

source: * If a variable doesn't exist yet, or if the name has been mis-spelled,
it: * Se una variabile non esiste ancora, o se il nome è stato scritto sbagliato,

source: Python reports an error. (Unlike some languages, which "guess" a default value.)
it: Python restituisce un errore. (A differenza di altri linguaggi, che cercano di "indovinare" un valore predefinito.)

source: ~~~ print(last_name) ~~~
it: ~~~ print(cognome) ~~~

source: {: .language-python} ~~~ --------------------------------------------------------------------------- NameError Traceback (most recent call last) <ipython-input-1-c1fbb4e96102> in <module>() ----> 1 print(last_name)
it: {: .language-python} ~~~ --------------------------------------------------------------------------- NameError Traceback (most recent call last) <ipython-input-1-c1fbb4e96102> in <module>() ----> 1 print(cognome)

source: NameError: name 'last_name' is not defined ~~~
it: NameError: name 'cognome' is not defined ~~~

source: * The last line of an error message is usually the most informative.
it: * L'ultima riga dei messaggi di errore è di solito quella più utile.

source: * We will look at error messages in detail [later]({{ page.root }}/15-scope/#reading-error-messages).
it: * Ci occuperemo dei messaggi d'errore più in dettaglio [più avanti]({{ page.root }}/15-scope/#reading-error-messages).

source: > ## Variables Persist Between Cells
it: > ## Le variabili restano accessibili da una cella all'altra

source: > > Be aware that it is the *order* of execution of cells that is important in a Jupyter notebook, not the order > in which they appear. Python will remember *all* the code that was run previously, including any variables you have > defined, irrespective of the order in the notebook. Therefore if you define variables lower down the notebook and then > (re)run cells further up, those defined further down will still be present. As an example, create two cells with the > following content, in this order: > > ~~~ > print(myval) > ~~~ > {: .language-python} > > ~~~ > myval = 1 > ~~~ > {: .language-python} > > If you execute this in order, the first cell will give an error. However, if you run the first cell *after* the second > cell it will print out `1`. To prevent confusion, it can be helpful to use the `Kernel` -> `Restart & Run All` option which > clears the interpreter and runs everything from a clean slate going top to bottom.
it: > > Notate che ciò che è importante usando il Jupyter notebook è l'*ordine di esecuzione* delle celle, non l'ordine > in cui compaiono. Python tiene a mente *tutto* il codice che è stato eseguito in precedenza, incluse le variabili che sono state definite, > indipendentemente dall'ordine in cui sono scritte nel notebook. Per cui, se definisci una variabile più in basso > e poi esegui o riesegui celle più in alto, quelle definite in basso esisteranno ancora. Per esempio, crea due celle con il seguente contenuto, nell'ordine: > > ~~~ > print(mio_valore) > ~~~ > {: .language-python} > > ~~~ > mio_valore = 1 > ~~~ > {: .language-python} > > Se esegui le due celle in ordine, la prima darà un errore. Però, se esegui la prima cella *dopo* la seconda, > stamperà `1`. Per evitare confusione, può essere utile usare l'opzione `Kernel` -> `Restart & Run All` (riavvia e esegui tutto), che > ripulisce l'interprete e esegue tutte le celle dall'alto in basso ripartendo da zero.

source: ## Variables can be used in calculations.
it: ## Le variabili si possono usare per fare calcoli.

source: * We can use variables in calculations just as if they were values.
it: * Possiamo usare variabili nei calcoli come se fossero numeri.

source: * Remember, we assigned the value `42` to `age` a few lines ago.
it: * Ricorda che, poche righe più in su, abbiamo assegnato il valore `42` alla variabile `anni`.

source: ~~~ age = age + 3 print('Age in three years:', age) ~~~
it: ~~~ anni = anni + 3 print('Età tra tre anni:', anni) ~~~

source: {: .language-python} ~~~ Age in three years: 45 ~~~
it: {: .language-python} ~~~ Età tra tre anni: 45 ~~~

source: ## Use an index to get a single character from a string.
it: ## Usare un indice per estrarre un singolo carattere da una stringa.

source: * The characters (individual letters, numbers, and so on) in a string are
it: * I caratteri (le singole lettere, numeri, eccetera) che formano una stringa

source: ordered. For example, the string `'AB'` is not the same as `'BA'`. Because of this ordering, we can treat the string as a list of characters. * Each position in the string (first, second, etc.) is given a number. This number is called an **index** or sometimes a subscript. * Indices are numbered from 0. * Use the position's index in square brackets to get the character at that position.
it: sono ordinati. Per esempio, la stringa `'AB'` non è la stessa cosa di `'BA'`. A causa di questo ordinamento, possiamo trattare la stringa come una lista di caratteri. * Ogni posizione nella stringa (prima, seconda, ecc.) corrisponde a un numero. Questo numero è detto **indice**. * Gli indici sono contati a partire da 0. * Per ottenere il carattere corrispondente a una certa posizione, si usa il relativo indice tra parentesi quadre.

source: ![an illustration of indexing](../fig/2_indexing.svg)
it: ![un esempio di indicizzazione](../fig/2_indexing.svg)

source: ~~~ atom_name = 'helium' print(atom_name[0]) ~~~
it: ~~~ nome_atomo = 'elio' print(nome_atomo[0]) ~~~

source: {: .language-python} ~~~ h ~~~
it: {: .language-python} ~~~ e ~~~

source: ## Use a slice to get a substring.
it: ## Usare una slice per estrarre una sotto-stringa.

source: * A part of a string is called a **substring**. A substring can be as short as a
it: * Una parte di una stringa si chiama **sotto-stringa** (substring). Una sotto-stringa può essere formata anche solo da

source: single character. * An item in a list is called an element. Whenever we treat a string as if it were a list, the string's elements are its individual characters. * A slice is a part of a string (or, more generally, any list-like thing). * We take a slice by using `[start:stop]`, where `start` is replaced with the index of the first element we want and `stop` is replaced with the index of the element just after the last element we want. * Mathematically, you might say that a slice selects `[start:stop)`. * The difference between `stop` and `start` is the slice's length. * Taking a slice does not change the contents of the original string. Instead, the slice is a copy of part of the original string.
it: un carattere singolo. * Un membro di una lista è detto elemento della lista. Quando trattiamo una stringa come fosse una lista, gli elementi della stringa sono i suoi singoli caratteri. * Una *slice* (fetta) è una parte di una stringa (o, più in generale, di qualsiasi cosa analoga a una lista). * Si estrae una slice (o si "affetta" una lista) scrivendo `[inizio:fine]`, dove `inizio` è sostituito dall' indice del primo elemento che vogliamo, e `fine` è sostituito dall'indice dell'elemento immediatamente successivo all'ultimo elemento che vogliamo. * Matematicamente, possiamo dire che la slice seleziona l'intervallo `[inizio, fine)`. * La differenza tra `fine` e `inizio` è la lunghezza della slice. * Estrarre una slice non cambia i contenuti della stringa originale. Al contrario, la slice è una copia di parte della stringa originale.

source: ~~~ atom_name = 'sodium' print(atom_name[0:3]) ~~~
it: ~~~ nome_atomo = 'sodio' print(nome_atomo[0:3]) ~~~

source: ## Use the built-in function `len` to find the length of a string.
it: ## Usare la funzione predefinita `len` per sapere la lunghezza di una stringa.

source: ~~~ print(len('helium')) ~~~
it: ~~~ print(len('elio')) ~~~

source: {: .language-python} ~~~ 6 ~~~
it: {: .language-python} ~~~ 4 ~~~

source: * Nested functions are evaluated from the inside out,
it: * Le funzioni eseguite una dentro l'altra sono chiamate dall'interno all'esterno.

source: like in mathematics.
it: come in matematica.

source: ## Python is case-sensitive.
it: ## Python distingue tra maiuscole e minuscole

source: * Python thinks that upper- and lower-case letters are different,
it: * Python nota la differenza tra lettere maiuscole e minuscole,

source: so `Name` and `name` are different variables. * There are conventions for using upper-case letters at the start of variable names so we will use lower-case letters for now.
it: perciò `Nome` and `nome` sono due variabili diverse. * Poiché ci sono convenzioni sull'uso delle lettere maiuscole all'inizio dei nomi di variabili, per ora useremo le lettere minuscole.

source: ## Use meaningful variable names.
it: ## Usare nomi sensati per le variabili.

source: * Python doesn't care what you call variables as long as they obey the rules
it: * Dal punto di vista di Python, non è importante il nome dato alle variabili, purché seguano le regole dette

source: (alphanumeric characters and the underscore).
it: (caratteri alfanumerici e trattino basso).

source: ~~~ flabadab = 42 ewr_422_yY = 'Ahmed' print(ewr_422_yY, 'is', flabadab, 'years old') ~~~
it: ~~~ flabadab = 42 ewr_422_yY = 'Ahmed' print(ewr_422_yY, 'ha', flabadab, 'anni') ~~~

source: * Use meaningful variable names to help other people understand what the program does.
it: * Usa nomi di variabili dal significato chiaro, in modo da aiutare gli altri a capire cosa faccia il tuo programma.

source: * The most important "other person" is your future self.
it: * Tra questi "altri", il più importante è te stesso nel futuro.

source: > ## Swapping Values
it: > ## Scambiare valori

source: > > Fill the table showing the values of the variables in this program > *after* each statement is executed. > > ~~~ > # Command # Value of x # Value of y # Value of swap # > x = 1.0 # # # # > y = 3.0 # # # # > swap = x # # # # > x = y # # # # > y = swap # # # # > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > # Command # Value of x # Value of y # Value of swap # > > x = 1.0 # 1.0 # not defined # not defined # > > y = 3.0 # 1.0 # 3.0 # not defined # > > swap = x # 1.0 # 3.0 # 1.0 # > > x = y # 3.0 # 3.0 # 1.0 # > > y = swap # 3.0 # 1.0 # 1.0 # > > ~~~ > > {: .output} > > > > These three lines exchange the values in `x` and `y` using the `swap` > > variable for temporary storage. This is a fairly common programming idiom.
it: > > Completa la tabella indicando i valori delle variabili in questo programma > *dopo* l'esecuzione di ogni istruzione. > > ~~~ > # Comando # Valore di x # Valore di y # Valore di scambio # > x = 1.0 # # # # > y = 3.0 # # # # > scambio = x # # # # > x = y # # # # > y = scambio # # # # > ~~~ > {: .language-python} > > ## Soluzione > > > > ~~~ > > # Comando # Valore di x # Valore di y # Valore di scambio # > > x = 1.0 # 1.0 # non definito # non definito # > > y = 3.0 # 1.0 # 3.0 # non definito # > > scambio = x # 1.0 # 3.0 # 1.0 # > > x = y # 3.0 # 3.0 # 1.0 # > > y = scambio # 3.0 # 1.0 # 1.0 # > > ~~~ > > {: .output} > > > > Queste tre righe scambiano i valori di `x` e `y` usando la variabile `scambio` > > come memoria temporanea. È un metodo abbastanza comune in programmazione.

source: > ## Predicting Values
it: > ## Prevedere i valori

source: > > What is the final value of `position` in the program below? > (Try to predict the value without running the program, > then check your prediction.) > > ~~~ > initial = 'left' > position = initial > initial = 'right' > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > 'left' > > ~~~ > > {: .output} > > >> The `initial` variable is assigned the value `'left'`. > > In the second line, the `position` variable also receives >> the string value `'left'`. In third line, the `initial` variable is given the >> value `'right'`, but the `position` variable retains its string value >> of `'left'`.
it: > > Qual è il valore finale di `posizione` nel programma seguente? > (Prova a prevedere il valore senza eseguire il programma, > poi verifica la tua previsione.) > > ~~~ > inizio = 'sinistra' > posizione = inizio > inizio = 'destra' > ~~~ > {: .language-python} > > ## Solution > > > > ~~~ > > 'sinistra' > > ~~~ > > {: .output} > > >> Alla variabile `inizio` è assegnato il valore `'sinistra'`. > > Nella seconda riga, la variabile `posizione` riceve anch'essa il valore >> `'sinistra'`. Nella terza riga, alla variabile `inizio` è assegnato il >> valore `'destra'`, ma la variabile `posizione` mantiene il valore >> di `'sinistra'`.

source: > ## Challenge
it: > ## Sfida

source: > > If you assign `a = 123`, > what happens if you try to get the second digit of `a` via `a[1]`? > > > ## Solution > > Numbers are not strings or sequences and Python will raise an error if you try to perform an index operation on a > > number. In the [next lesson on types and type conversion]({{ page.root }}/03-types-conversion/#convert-numbers-and-strings) > > we will learn more about types and how to convert between different types. If you want the Nth digit of a number you > > can convert it into a string using the `str` built-in function and then perform an index operation on that string. > > > > ~~~ > > a = 123 > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > TypeError: 'int' object is not subscriptable > > ~~~ > > {: .error} > > > > > > ~~~ > > a = str(123) > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > 2 > > ~~~ > > {: .output}
it: > > Se definisci `a = 123`, > cosa succede se provi a ottenere la seconda cifra di `a` usando `a[1]`? > > > ## Soluzione > > I numeri non sono né stringhe né sequenze e Python darà un errore se cerchi di fare un'operazione con gli indici > > su un numero. Nella prossima lezione su [tipi e conversioni di tipo]({{ page.root }}/03-types-conversion/#convert-numbers-and-strings) > > impareremo altri concetti sui tipi e su come convertire da un tipo ad un altro. Se ti serve l'N-esima cifra di un numero, > > puoi convertirlo in una stringa usando la funzione predefinita `str` e poi fare l'operazione con gli indici sulla stringa risultante. > > > > ~~~ > > a = 123 > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > TypeError: 'int' object is not subscriptable > > ~~~ > > {: .error} > > > > > > ~~~ > > a = str(123) > > print(a[1]) > > ~~~ > > {: .language-python} > > ~~~ > > 2 > > ~~~ > > {: .output}

source: > ## Choosing a Name
it: > ## Scegliere un nome

source: > > Which is a better variable name, `m`, `min`, or `minutes`? > Why? > Hint: think about which code you would rather inherit > from someone who is leaving the lab: > > 1. `ts = m * 60 + s` > 2. `tot_sec = min * 60 + sec` > 3. `total_seconds = minutes * 60 + seconds` > > > ## Solution > > > > `minutes` is better because `min` might mean something like "minimum" > > (and actually is an existing built-in function in Python that we will cover later).
it: > > Quale di questi è un nome migliore per una variabile, `m`, `min`, o `minuti`? > Perché? > Suggerimento: pensa a quale codice tra i seguenti preferiresti ricevere in eredità > da qualcuno che sta lasciando a te il suo lavoro: > > 1. `ts = m * 60 + s` > 2. `tot_sec = min * 60 + sec` > 3. `total_seconds = minutes * 60 + seconds` > > > ## Soluzione > > > > `minuti` è meglio, perché `min` potrebbe indicare qualcosa come "minimo" > > (e infatti è una funzione predefinita esistente in Python, che tratteremo più avanti).

source: > ## Slicing practice
it: > ## Pratica con le slice

source: > > What does the following program print? > > ~~~ > atom_name = 'carbon' > print('atom_name[1:3] is:', atom_name[1:3]) > ~~~ > {: .language-python} > > > ## Solution > > > > ~~~ > > atom_name[1:3] is: ar > > ~~~ > > {: .output}
it: > > Che cosa stampa il seguente programma? > > ~~~ > nome_atomo = 'carbonio' > print('nome_atomo[1:3] è:', nome_atomo[1:3]) > ~~~ > {: .language-python} > > > ## Soluzione > > > > ~~~ > > nome_atomo[1:3] è: ar > > ~~~ > > {: .output}

source: > ## Slicing concepts
it: > ## Concetti sulle slice

source: > > 1. What does `thing[low:high]` do? > 2. What does `thing[low:]` (without a value after the colon) do? > 3. What does `thing[:high]` (without a value before the colon) do? > 4. What does `thing[:]` (just a colon) do? > 5. What does `thing[number:some-negative-number]` do? > 6. What happens when you choose a `high` value which is out of range? (i.e., try `atom_name[0:15]`) > > > ## Solutions > > > > 1. `thing[low:high]` returns a slice from `low` to the value before `high` > > 2. `thing[low:]` returns a slice from `low` all the way to the end of `thing` > > 3. `thing[:high]` returns a slice from the beginning of `thing` to the value before `high` > > 4. `thing[:]` returns all of `thing` > > 5. `thing[number:some-negative-number]` returns a slice from `number` to `some-negative-number` values from the end of `thing` > > 6. If a part of the slice is out of range, the operation does not fail. `atom_name[0:15]` gives the same result as `atom_name[0:]`.
it: > > 1. Cosa fa `qualcosa[inizio:fine]`? > 2. Cosa fa `qualcosa[inizio:]` (senza un valore dopo i due punti)? > 3. Cosa fa `qualcosa[:fine]` (senza un valore prima dei due punti)? > 4. Cosa fa `qualcosa[:]` (solo i due punti)? > 5. Cosa fa `qualcosa[numero:un-numero-negativo]`? > 6. Cosa succede quando scegli un valore di `fine` che è fuori dai limiti? (per esempio, prova `nome_atomo[0:15]`) > > > ## Soluzioni > > > > 1. `qualcosa[inizio:fine]` restituisce una "fetta" da `inizio` fino al valore precedente a `fine` > > 2. `qualcosa[inizio:]` restituisce una fetta da `low` fino alla fine di `qualcosa` > > 3. `qualcosa[:fine]` restituisce una fetta dal principio di `qualcosa` fino al valore precedente a `fine` > > 4. `qualcosa[:]` restituisce interamente `qualcosa` > > 5. `qualcosa[numero:un-numero-negativo]` restituisce una fetta da `numero` fino a `un-numero-negativo` valori contati dalla fine di `qualcosa`. > > 6. Se una parte della slice è fuori dai limiti, l'operazione non fallisce. `nome_atomo[0:15]` dà lo stesso risultato di `nome_atomo[0:]`.

source: --- title: "Data Types and Type Conversion" teaching: 10 exercises: 10 questions: - "What kinds of data do programs store?" - "How can I convert one type to another?" objectives: - "Explain key differences between integers and floating point numbers." - "Explain key differences between numbers and character strings." - "Use built-in functions to convert between integers, floating point numbers, and strings." keypoints: - "Every value has a type." - "Use the built-in function `type` to find the type of a value." - "Types control what operations can be done on values." - "Strings can be added and multiplied." - "Strings have a length (but numbers don't)." - "Must convert numbers to strings or vice versa when operating on them." - "Can mix integers and floats freely in operations." - "Variables only change value when something is assigned to them." ---
it: --- title: "Tipi di dati e conversioni di tipo" teaching: 10 exercises: 10 questions: - "Quali tipi di dati si possono memorizzare in un programma?" - "Come si possono convertire dati da un tipo a un altro?" objectives: - "Spiegare le principali differenze tra gli interi e i numeri a virgola mobile." - "Spiegare le principali differenze tra numeri e stringhe di caratteri." - "Usare funzioni predefinite per convertire tra interi, numeri a virgola mobile e stringhe." keypoints: - "Ogni valore ha un tipo." - "Per scoprire il tipo di una variabile, si usa la funzione predefinita `type`." - "In base al tipo, le operazioni che si possono fare su un valore sono diverse." - "Le stringhe possono essere sommate e moltiplicate." - "Le stringhe hanno una lunghezza, i numeri no." - "Lavorando su stringhe e numeri, è necessario convertire stringhe in numeri o viceversa." - "Gli interi e i numeri a virgola mobile possono essere usati insieme liberamente in operazioni matematiche." - "Le variabili possono cambiare valore solo quando un nuovo valore viene loro assegnato." ---

source: ## Every value has a type.
it: ## Tutti i valori hanno un tipo.

source: * Every value in a program has a specific type.
it: * In un programma, ogni valore è di uno specifico tipo.

source: * Integer (`int`): represents positive or negative whole numbers like 3 or -512.
it: * Intero (integer, `int`): rappresenta numeri interi positivi o negativi, come 3 or -512.

source: * Floating point number (`float`): represents real numbers like 3.14159 or -2.5.
it: * Numero a virgola mobile (`float`): rappresenta numeri reali come 3.14159 o -2.5. Notare che il separatore decimale è il punto, `.`, come nell'uso anglofono, e non la virgola, `,`, come si usa generalmente in italiano.

source: * Character string (usually called "string", `str`): text.
it: * Stringa di caratteri (normalmente chiamata "string" o "stringa", `str`): del testo.

source: * Written in either single quotes or double quotes (as long as they match).
it: * Può essere scritta o in virgolette alte singole o in virgolette alte doppie (purché l'uso sia coerente).
